{
  "wikis": [
    {
      "id": "1",
      "title": "React",
      "content": "Biblioteca JS"
    },
    {
      "id": 8145,
      "userId": 1,
      "content": "December 15 is the 349th day of the year (350th in leap years) in the Gregorian calendar;  16 days remain until the end of the year.\n\n\n== Events ==\n\n\n=== Pre-1600 ===\n533 – Vandalic War: Byzantine general Belisarius defeats the Vandals, commanded by King Gelimer, at the Battle of Tricamarum.\n687 – Pope Sergius I is elected as a compromise between antipopes Paschal and Theodore.\n1025 – Constantine VIII becomes sole emperor of the Byzantine Empire, 63 years after being crowned co-emperor.\n1161 – Jin–Song wars: Military officers conspire against the emperor Wanyan Liang of the Jin dynasty after a military defeat at the Battle of Caishi, and assassinate the emperor at his camp.\n1167 – Sicilian Chancellor Stephen du Perche moves the royal court to Messina to prevent a rebellion.\n1256 – Mongol forces under Hulagu enter and dismantle the Nizari Ismaili (Assassin) stronghold at Alamut Castle (in present-day Iran) as part of their offensive on Islamic southwest Asia.\n1270 – The Nizari Ismaili garrison of Gerdkuh, Persia surrender after 17 years to the Mongols.\n1467 – Stephen III of Moldavia defeats Matthias Corvinus of Hungary, with the latter being injured thrice, at the Battle of Baia.\n1546 – The town of Ekenäs (Finnish: Tammisaari) is founded by King Gustav Vasa of Sweden.\n\n\n=== 1601–1900 ===\n1651 – Castle Cornet in Guernsey, the last stronghold which had supported the King in the Third English Civil War, surrenders.\n1778 – American Revolutionary War: British and French fleets clash in the Battle of St. Lucia.\n1791 – The United States Bill of Rights becomes law when ratified by the Virginia General Assembly.\n1836 – The U.S. Patent Office building in Washington, D.C., nearly burns to the ground, destroying all 9,957 patents issued by the federal government to that date, as well as 7,000 related patent models.\n1862 – American Civil War: The Battle of Fredericksburg ends in a Union defeat as General Ambrose Burnside withdraws the Army of the Potomac across the Rappahannock River.\n1864 – American Civil War: The Battle of Nashville begins at Nashville, Tennessee, and ends the following day with the destruction of the Confederate Army of Tennessee under General John Bell Hood as a fighting force by the Union Army of the Cumberland under General George H. Thomas.\n1869 – The short-lived Republic of Ezo is proclaimed in the Ezo area of Japan. It is the first attempt to establish a democracy in Japan.\n1871 – Sixteen-year-old telegraphist Ella Stewart keys and sends the first telegraphed message from Arizona Territory at the Deseret Telegraph Company office in Pipe Spring.\n1890 – Hunkpapa Lakota leader Sitting Bull is killed on Standing Rock Indian Reservation, leading to the Wounded Knee Massacre.\n1893 – Symphony No. 9 (\"From the New World\" a.k.a. the \"New World Symphony\") by Antonín Dvořák premieres in a public afternoon rehearsal at Carnegie Hall in New York City, followed by a concert premiere on the evening of December 16.\n1899 – British Army forces are defeated at the Battle of Colenso in Natal, South Africa, the third and final battle fought during the Black Week of the Second Boer War.\n\n\n=== 1901–present ===\n1903 – Italian American food cart vendor Italo Marchiony receives a U.S. patent for inventing a machine that makes ice cream cones.\n1905 – The Pushkin House is established in Saint Petersburg, Russia, to preserve the cultural heritage of Alexander Pushkin.\n1906 – The London Underground's Great Northern, Piccadilly and Brompton Railway opens.\n1914 – World War I: The Serbian Army recaptures Belgrade from the invading Austro-Hungarian Army.\n1914   – A gas explosion at Mitsubishi Hōjō coal mine, in Kyushu, Japan, kills 687.\n1917 – World War I: An armistice between Russia and the Central Powers is signed.\n1933 – Anarchist insurrection suppressed in Zaragoza, Spain.\n1939 – Gone with the Wind (highest inflation adjusted grossing film) receives its premiere at Loew's Grand Theatre in Atlanta, Georgia, United States.\n1941 – The Holocaust in Ukraine: German troops murder over 15,000 Jews at Drobytsky Yar, a ravine southeast of the city of Kharkiv.\n1942 – World War II: The Battle of Mount Austen, the Galloping Horse, and the Sea Horse begins during the Guadalcanal Campaign.\n1943 – World War II: The Battle of Arawe begins during the New Britain campaign.\n1944 – World War II: a single-engine UC-64A Norseman aeroplane carrying United States Army Air Forces Major Glenn Miller is lost in a flight over the English Channel.\n1945 – Occupation of Japan/Shinto Directive: General Douglas MacArthur orders that Shinto be abolished as the state religion of Japan.\n1960 – Richard Pavlick is arrested for plotting to assassinate U.S. President-Elect John F. Kennedy.\n1960   – King Mahendra of Nepal suspends the country's constitution, dissolves parliament, dismisses the cabinet, and imposes direct rule.\n1961 – Eichmann trial: Adolf Eichmann is sentenced to death after being found guilty by an Israeli court of 15 criminal charges, including charges of crimes against humanity, crimes against the Jewish people, and membership of an outlawed organization.\n1965 – Project Gemini: Gemini 6A, crewed by Wally Schirra and Thomas Stafford, is launched from Cape Kennedy, Florida. Four orbits later, it achieves the first space rendezvous, with Gemini 7.\n1970 – Soviet spacecraft Venera 7 successfully lands on Venus. It is the first successful soft landing on another planet.\n1973 – John Paul Getty III, grandson of American billionaire J. Paul Getty, is found alive near Naples, Italy, after being kidnapped by an Italian gang on July 10.\n1973   – The American Psychiatric Association votes 13–0 to remove homosexuality from its official list of psychiatric disorders, the Diagnostic and Statistical Manual of Mental Disorders.\n1978 – U.S. President Jimmy Carter announces that the United States will recognize the People's Republic of China and sever diplomatic relations with the Republic of China (Taiwan).\n1981 – A suicide car bombing targeting the Iraqi embassy in Beirut, Lebanon, levels the embassy and kills 61 people, including Iraq's ambassador to Lebanon. The attack is considered the first modern suicide bombing.\n1989 – Second Optional Protocol to the International Covenant on Civil and Political Rights relating the abolition of capital punishment is adopted.\n1993 – The Troubles: The Downing Street Declaration is issued by British Prime Minister John Major and Irish Taoiseach Albert Reynolds.\n1997 – Tajikistan Airlines Flight 3183 crashes in the desert near Sharjah, United Arab Emirates, killing 85.\n2000 – The third reactor at the Chernobyl Nuclear Power Plant is shut down.\n2001 – The Leaning Tower of Pisa reopens after 11 years and $27,000,000 spent to stabilize it, without fixing its famous lean.\n2005 – Introduction of the Lockheed Martin F-22 Raptor into USAF active service.\n2010 – A boat carrying 90 asylum seekers crashes into rocks off the coast of Christmas Island, Australia, killing 48 people.\n2013 – The South Sudanese Civil War begins when opposition leaders Dr. Riek Machar, Pagan Amum and Rebecca Nyandeng vote to boycott the meeting of the National Liberation Council at Nyakuron.\n2014 – Gunman Man Haron Monis takes 18 hostages inside a café in Martin Place for 16 hours in Sydney. Monis and two hostages are killed when police raid the café the following morning.\n2017 – A 6.5Mw earthquake strikes the Indonesian island of Java in the city of Tasikmalaya, resulting in four deaths.\n\n\n== Births ==\n\n\n=== Pre-1600 ===\nAD 37 – Nero, Roman emperor (d. 68)\n130 – Lucius Verus, Roman emperor (d. 169)\n1242 – Prince Munetaka, Japanese shōgun (d. 1274)\n1447 – Albert IV, Duke of Bavaria (d. 1508)\n1567 – Christoph Demantius, German composer, poet, and theorist (d. 1643)\n\n\n=== 1601–1900 ===\n1610 – David Teniers the Younger, Flemish painter (d. 1690)\n1657 – Michel Richard Delalande, French organist and composer (d. 1726)\n1686 – Jean-Joseph Fiocco, Flemish violinist and composer (d. 1746)\n1710 – Francesco Zahra, Maltese painter (d. 1773)\n1789 – Carlos Soublette, Venezuelan general and politician, 11th President of Venezuela (d. 1870)\n1832 – Gustave Eiffel, French architect and engineer, co-designed the Eiffel Tower (d. 1923)\n1837 – E. W. Bullinger, English minister, scholar, and theologian (d. 1913)\n1846 – Amunda Kolderup, Norwegian opera singer (d. 1882)\n1852 – Henri Becquerel, French physicist and chemist, Nobel Prize laureate (d. 1908)\n1859 – L. L. Zamenhof, Polish linguist and ophthalmologist, created Esperanto (d. 1917)\n1860 – Niels Ryberg Finsen, Faroese-Danish physician and educator, Nobel Prize laureate (d. 1904)\n1860   – Abner Powell, American baseball player and manager (d. 1953)\n1861 – Charles Duryea, American engineer and businessman, co-founded the Duryea Motor Wagon Company (d. 1938)\n1861   – Pehr Evind Svinhufvud, Finnish lawyer, judge, and politician, 3rd President of Finland (d. 1944)\n1863 – Arthur Dehon Little, American chemist and engineer (d. 1935)\n1869 – Leon Marchlewski, Polish chemist and academic (d. 1946)\n1875 – Emilio Jacinto, Filipino journalist and activist (d. 1899)\n1878 – Hans Carossa, German author and poet (d. 1956)\n1885 – Leonid Pitamic, Slovenian lawyer, philosopher, and academic (d. 1971)\n1886 – Wanda Krahelska-Filipowicz, Polish politician and resistance fighter (d. 1968)\n1886   – Florence Jepperson Madsen, American contralto singer and professor of music (d. 1977)\n1888 – Maxwell Anderson, American journalist and playwright (d. 1959)\n1890 – Harry Babcock, American pole vaulter (d. 1965)\n1891 – A.P. Carter, American country singer-songwriter and musician (d. 1960)\n1892 – J. Paul Getty, American-English businessman and art collector, founded Getty Oil (d. 1976)\n1894 – Vibert Douglas, Canadian astrophysicist and astronomer (d. 1988)\n1894   – Josef Imbach, Swiss sprinter (d. 1964)\n1896 – Betty Smith, American author and playwright (d. 1972)\n1899 – Harold Abrahams, English sprinter, lawyer, and journalist (d. 1978)\n\n\n=== 1901–present ===\n1902 – Robert F. Bradford, American lawyer and politician, 57th Governor of Massachusetts (d. 1983)\n1903 – Tamanishiki San'emon, Japanese sumo wrestler, the 32nd Yokozuna (d. 1938)\n1907 – Gordon Douglas, American actor, director, and screenwriter (d. 1993)\n1907   – Oscar Niemeyer, Brazilian architect, designed the United Nations Headquarters and the Cathedral of Brasília (d. 2012)\n1908 – Swami Ranganathananda, Indian monk, scholar, and author (d. 2005)\n1909 – Sattar Bahlulzade, Azerbaijani-Russian painter (d. 1974)\n1909   – Eliza Atkins Gleason, American librarian (d. 2009)\n1910 – John Hammond, American record producer and critic (d. 1987)\n1911 – Nicholas P. Dallis, American psychiatrist and illustrator (d. 1991)\n1911   – Stan Kenton, American pianist and composer (d. 1979)\n1913 – Roger Gaudry, Canadian chemist and businessman (d. 2001)\n1913   – Muriel Rukeyser, American poet, academic, and activist (d. 1980)\n1915 – Eila Campbell, English geographer and cartographer (d. 1994)\n1916 – Miguel Arraes, Brazilian lawyer and politician, Governor of Pernambuco (d. 2005)\n1916   – Buddy Cole, American pianist and conductor (d. 1964)\n1916   – Maurice Wilkins, New Zealand-English physicist and biologist, Nobel Prize laureate (d. 2004)\n1917 – Shan-ul-Haq Haqqee, Indian-Pakistani linguist and lexicographer (d. 2005)\n1918 – Jeff Chandler, American actor (d. 1961)\n1918   – Chihiro Iwasaki, Japanese painter and illustrator (d. 1974)\n1919 – Max Yasgur, American dairy farmer and host of the Woodstock Music & Art Fair (d. 1973)\n1920 – Gamal al-Banna, Egyptian author and scholar (d. 2013)\n1920   – Kurt Schaffenberger, German-American sergeant and illustrator (d. 2002)\n1921 – Alan Freed, American radio host (d. 1965)\n1923 – Pierre Cossette, American producer and manager (d. 2009)\n1923   – Freeman Dyson, English-American physicist and mathematician (d. 2020)\n1923   – Uziel Gal, German-Israeli engineer, designed the Uzi gun (d. 2002)\n1923   – Valentin Varennikov, Russian general and politician (d. 2009)\n1924 – Frank W. J. Olver, English-American mathematician and academic (d. 2013)\n1924   – Ruhi Sarıalp, Turkish triple jumper and educator (d. 2001)\n1925 – Kasey Rogers, American actress and author (d. 2006)\n1926 – Bill Pitt, Australian race car driver (d. 2017) \n1928 – Ernest Ashworth, American singer-songwriter (d. 2009)\n1928   – Ida Haendel, Polish-English violinist and educator (d. 2020)\n1928   – Friedensreich Hundertwasser, Austrian-New Zealand painter and architect (d. 2000)\n1930 – Edna O'Brien, Irish novelist, playwright, poet and short story writer (d. 2024)\n1931 – Klaus Rifbjerg, Danish author and poet (d. 2015)\n1932 – Jesse Belvin, American singer-songwriter and pianist (d. 1960)\n1932   – John Meurig Thomas, Welsh chemist and academic (d. 2020)\n1933 – Bapu, Indian director and screenwriter (d. 2014)\n1933   – Tim Conway, American comedian, actor, producer, and screenwriter (d. 2019)\n1933   – Donald Woods, South African journalist and activist (d. 2001)\n1936 – Joe D'Amato, Italian director and producer (d. 1999)\n1938 – Michael Bogdanov, Welsh director and screenwriter (d. 2017)\n1938 – Billy Shaw, American football player (d. 2024)\n1939 – Cindy Birdsong, American singer-songwriter\n1939   – Dave Clark, English musician and songwriter\n1940 – Nick Buoniconti, American football player and sportscaster (d. 2019)\n1942 – Kathleen Blanco, American educator and politician, 54th Governor of Louisiana (d. 2019)\n1943 – Lucien den Arend, Dutch sculptor\n1944 – Jim Leyland, American baseball player and manager\n1944   – Chico Mendes, Brazilian trade union leader and activist (d. 1988)\n1945 – Heather Booth, American civil rights activist, feminist, and political strategist\n1945   – Ivor Crewe, English political scientist and academic\n1946 – Carmine Appice, American drummer and songwriter\n1946   – Art Howe, American baseball player and manager\n1946   – Genny Lim, American writer\n1946   – Comunardo Niccolai, Italian footballer (Torres, Cagliari, national team) (d. 2024)\n1948 – Cassandra Harris, Australian actress (d. 1991)\n1948   – Charlie Scott, American basketball player\n1949 – Don Johnson, American actor\n1949   – Brian Roper, English economist and academic\n1950 – Melanie Chartoff, American actress and comedian\n1950   – Sylvester James Gates, American theoretical physicist and professor\n1951 – George Donikian, Australian journalist\n1951   – Joe Jordan, Scottish footballer and manager\n1951   – Tim Webster, Australian journalist and sportscaster\n1952 – Rudi Protrudi, American singer-songwriter and producer\n1952   – Allan Simonsen, Danish footballer and manager\n1952   – Julie Taymor, American director, producer, and screenwriter\n1953 – John R. Allen, American general and diplomat\n1953   – J. M. DeMatteis, American author\n1953   – Robert Charles Wilson, American-Canadian author\n1954 – Alex Cox, English film director, screenwriter, actor, non-fiction author and broadcaster\n1954   – Oliver Heald, English lawyer and politician, Solicitor General for England and Wales\n1954   – Mark Warner, American businessman and politician, 69th Governor of Virginia\n1955 – Hector Sants, English banker\n1955   – Paul Simonon, English singer-songwriter and bass player\n1956 – John Lee Hancock, American screenwriter, film director, and producer\n1956   – Tony Leon, South African lawyer and politician\n1957 – Mario Marois, Canadian ice hockey player and sportscaster\n1957   – Mike McAlary, American journalist and author (d. 1998)\n1957   – Tim Reynolds, German-American singer-songwriter and guitarist\n1958 – Carlo J. Caparas, Filipino director and producer\n1958   – Richard Kastle, American classical pianist\n1959 – Greg Matthews, Australian cricketer\n1959   – Alan Whetton, New Zealand rugby player\n1959   – Gary Whetton, New Zealand rugby player\n1960 – Walter Werzowa, Austrian composer and producer\n1961 – Karin Resetarits, Austrian journalist and politician\n1962 – Tim Gaines, American bass player\n1962   – Simon Hodgkinson, English rugby player and coach\n1963 – Ellie Cornell, American actress and producer\n1963   – Norman J. Grossfeld, American screenwriter and producer\n1963   – Helen Slater, American actress\n1963   – David Wingate, American basketball player\n1964 – Paul Kaye, English actor\n1966 – Carl Hooper, Guyanese cricketer and coach\n1966   – Molly Price, American actress\n1967 – David Howells, English footballer and coach\n1967   – Mo Vaughn, American baseball player\n1968 – Garrett Wang, American actor\n1969 – Ralph Ineson, English actor\n1969   – Chantal Petitclerc, Canadian wheelchair racer and senator\n1969   – Adam Setliff, American discus thrower and lawyer\n1970 – Frankie Dettori, Italian jockey\n1970   – Lawrence Funderburke, American basketball player\n1970   – Michael Shanks, Canadian actor, screenwriter and director\n1971 – Clint Lowery, American singer-songwriter, guitarist, and producer\n1972 – Rodney Harrison, American football player and sportscaster\n1972   – Lee Jung-jae, South Korean actor\n1972   – Stuart Townsend, Irish actor\n1972   – Alexandra Tydings, American actress, director, writer and producer\n1973 – Surya Bonaly, French figure skater\n1973   – Ryoo Seung-wan, South Korean actor, director, and screenwriter\n1974 – Garath Archer, English rugby player\n1974   – P. J. Byrne, American actor\n1975 – Samira Saraya,  Palestinian actor, filmmaker, poet and rapper\n1976 – Baichung Bhutia, Indian footballer and manager\n1976   – Kim Eagles, Canadian sport shooter\n1976   – Aaron Miles, American baseball player and coach\n1976   – Todd Tichenor, American baseball player and umpire\n1977 – Mehmet Aurélio, Brazilian-Turkish footballer and manager\n1977   – Geoff Stults, American actor and producer\n1978 – Ned Brower, American drummer\n1978   – Mark Jansen, Dutch guitarist and songwriter\n1978   – Jerome McDougle, American football player\n1979 – Adam Brody, American actor\n1979   – Eric Young, Canadian-American wrestler\n1980 – Élodie Gossuin, French beauty pageant titleholder and model\n1980   – Sergio Pizzorno, English singer-songwriter and guitarist\n1980   – Manuel Wilhelm, German rugby player\n1981 – Michelle Dockery, English actress\n1981   – Brendan Fletcher, Canadian actor and screenwriter\n1981   – Andy González, Puerto Rican-American baseball player\n1981   – Thomas Herrion, American football player (d. 2005)\n1981   – Roman Pavlyuchenko, Russian footballer\n1982 – Charlie Cox, English actor\n1982   – Borja García, Spanish race car driver\n1982   – George O. Gore II, American actor and comedian\n1982   – Tatiana Perebiynis, Ukrainian tennis player\n1983 – Delon Armitage, Trinidadian-English rugby player\n1983   – René Duprée, Canadian professional wrestler\n1983   – Camilla Luddington, English actress\n1983   – Ronnie Radke, American singer-songwriter, guitarist, and producer\n1983   – Sophia Young, Vincentian-American basketball player\n1984 – Martyn Bernard, English high jumper\n1984   – Martin Škrtel, Slovak footballer\n1985 – Diogo Fernandes, Brazilian footballer\n1986 – Kim Junsu, South Korean singer-songwriter and dancer\n1986   – Iveta Mazáčová, Czech sprinter\n1986   – Keylor Navas, Costa Rican footballer\n1986   – Snejana Onopka, Ukrainian model\n1987 – Josh Norman, American football player\n1988 – Erik Gustafsson, Swedish ice hockey player\n1988   – Emily Head, English actress\n1988   – Steven Nzonzi, French footballer\n1989 – Nichole Bloom, American actress and model\n1991 – Conor Daly, American race car driver\n1991   – Yanni Gourde, Canadian ice hockey player\n1991   – Alana Haim, American musician and actress\n1992 – Daiamami Genki, Japanese sumo wrestler\n1992   – Jesse Lingard, English footballer\n1992   – Maximiliano Meza, Argentine footballer\n1992   – Alex Telles, Brazilian footballer\n1993 – Daniel Ochefu, American basketball player\n1995 – Jahlil Okafor, American basketball player\n1996 – Jenifer Brening, German singer\n1996   – Oleksandr Zinchenko, Ukrainian footballer\n1997 – Maude Apatow, American actress\n1997   – Zach Banks, American race car driver\n1997   – Magdalena Fręch, Polish tennis player\n1997   – Stefania LaVie Owen, New Zealand-American actress\n1998 – Chandler Canterbury, American actor\n2000 – Kayvon Thibodeaux, American football player\n\n\n== Deaths ==\n\n\n=== Pre-1600 ===\n933 – Li Siyuan, Chinese emperor (b. 867)\n1025 – Basil II, Byzantine emperor (b. 958)\n1072 – Alp Arslan, Turkish sultan (b. 1029)\n1161 – Wanyan Liang, Chinese emperor (b. 1122)\n1230 – Ottokar I, duke of Bohemia (b. 1155)\n1283 – Philip I, Latin emperor (b. 1243)\n1343 – Hasan Kucek, Chopanid prince (b. c. 1319)\n1467 – Jöns Bengtsson Oxenstierna, archbishop and regent of Sweden (b. 1417)\n1574 – Selim II, Ottoman sultan (b. 1524)\n1598 – Philips of Marnix, Lord of Saint-Aldegonde, Dutch nobleman (b. 1540)\n\n\n=== 1601–1900 ===\n1621 – Charles d'Albert, duc de Luynes, French courtier, Constable of France (b. 1578)\n1673 – Margaret Cavendish, Duchess of Newcastle-upon-Tyne, English noblewoman (b. 1623)\n1675 – Johannes Vermeer, Dutch painter and educator (b. 1632)\n1683 – Izaak Walton, English author (b. 1593)\n1688 – Gaspar Fagel, Dutch lawyer and politician (b. 1634)\n1698   – Louis Victor de Rochechouart de Mortemart, French nobleman (b. 1636)\n1715 – George Hickes, English minister and scholar (b. 1642)\n1753 – Richard Boyle, 3rd Earl of Burlington, English architect and politician, designed Chiswick House (b. 1694)\n1792 – Joseph Martin Kraus, Swedish pianist, violinist, and composer (b. 1756)\n1812 – Shneur Zalman, Russian rabbi, author and founder of Chabad (b. 1745)\n1817 – Federigo Zuccari, astronomer, director of the Astronomical Observatory of Naples (b. 1783)\n1819 – Daniel Rutherford, Scottish chemist and physician (b. 1749)\n1855 – Jacques Charles François Sturm, French mathematician and academic (b. 1803)\n1878 – Alfred Bird, English chemist and businessman, invented baking powder (b. 1811)\n1890 – Sitting Bull, Hunkpapa Lakota tribal chief (b. 1831)\n\n\n=== 1901–present ===\n1943 – Fats Waller, American singer-songwriter and pianist (b. 1904)\n1944 – Glenn Miller, American bandleader and composer (b. 1904)\n1947 – Arthur Machen, Welsh journalist and author (b. 1863)\n1947   – Crawford Vaughan, Australian politician, 27th Premier of South Australia (b. 1874)\n1950 – Vallabhbhai Patel, Indian lawyer and politician, 1st Deputy Prime Minister of India (b. 1875)\n1958 – Wolfgang Pauli, Austrian-Swiss physicist and academic, Nobel Prize laureate (b. 1900)\n1962 – Charles Laughton, English-American actor, director, and producer (b. 1899)\n1965 – M. Balasundaram, Sri Lankan journalist, lawyer, and politician (b. 1903)\n1966 – Keith Arbuthnott, 15th Viscount of Arbuthnott, Indian-Scottish general and politician, Lord Lieutenant of Kincardineshire (b. 1897)\n1966   – Walt Disney, American animator, director, producer, and screenwriter, co-founded The Walt Disney Company (b. 1901)\n1968 – Antonio Barrette, Canadian politician, 18th Premier of Quebec (b. 1899)\n1968   – Jess Willard, American boxer and actor (b. 1881)\n1969 – Karl Theodor Bleek, German lawyer and politician, 12th Mayor of Marburg (b. 1898)\n1971 – Paul Lévy, French mathematician and theorist (b. 1886)\n1974 – Anatole Litvak, Russian-American director, producer, and screenwriter (b. 1902)\n1977 – Wilfred Kitching, English 7th General of The Salvation Army (b. 1893)\n1978 – Chill Wills, American actor (b. 1903)\n1980 – Peter Gregg, American race car driver (b. 1940)\n1984 – Jan Peerce, American tenor and actor (b. 1904)\n1985 – Seewoosagur Ramgoolam, Mauritian physician and politician, 1st Prime Minister of Mauritius (b. 1900)\n1986 – Serge Lifar, Russian-French ballet dancer and choreographer (b. 1905)\n1989 – Edward Underdown, English actor and jockey (b. 1908)\n1991 – Vasily Zaytsev, Russian captain (b. 1915)\n1993 – William Dale Phillips, American chemist and engineer (b. 1925)\n2000 – Haris Brkić, Bosnian-Serbian basketball player (b. 1974)\n2003 – Vincent Apap, Maltese sculptor (b. 1909)\n2003   – George Fisher, American cartoonist (b. 1923)\n2003   – Keith Magnuson, Canadian ice hockey player and coach (b. 1947)\n2004 – Vassal Gadoengin, Nauruan educator and politician, Speaker of the Nauru Parliament (b. 1943)\n2005 – Heinrich Gross, Austrian physician and psychiatrist (b. 1914)\n2005   – Stan Leonard, Canadian golfer (b. 1915)\n2005   – William Proxmire, American soldier, journalist, and politician (b. 1915)\n2005   – Darrell Russell, American football player (b. 1976)\n2006 – Clay Regazzoni, Swiss race car driver (b. 1939)\n2006   – Mary Stolz, American journalist and author (b. 1920)\n2007 – Julia Carson, American lawyer and politician (b. 1938)\n2008 – León Febres Cordero, Ecuadorian engineer and politician, 46th President of Ecuador (b. 1931)\n2009 – Eliza Atkins Gleason, American librarian (b. 1909)\n2009   – Oral Roberts, American evangelist, founded the Oral Roberts Evangelistic Association (b. 1918)\n2010 – Blake Edwards, American director, producer, and screenwriter (b. 1922)\n2010   – Bob Feller, American baseball player and sportscaster (b. 1918)\n2010   – Eugene Victor Wolfenstein, American psychoanalyst and theorist (b. 1940)\n2011 – Bob Brookmeyer, American trombone player and composer (b. 1929)\n2011   – Christopher Hitchens, English-American essayist, literary critic, and journalist (b. 1949)\n2012 – Owoye Andrew Azazi, Nigerian general (b. 1952)\n2012   – Patrick Ibrahim Yakowa, Nigerian politician, 18th Governor of Kaduna State (b. 1948)\n2012   – Olga Zubarry, Argentinian actress (b. 1929)\n2013 – Harold Camping, American evangelist, author, radio host (b. 1921)\n2013   – Joan Fontaine, British-American actress (b. 1917)\n2013   – Dyron Nix, American basketball player (b. 1967)\n2014 – Donald Metcalf, Australian physiologist and immunologist (b. 1929)\n2014   – Fausto Zapata,  Mexican journalist, lawyer, and politician, Governor of San Luis Potosí (b. 1940)\n2015 – Harry Zvi Tabor, English-Israeli physicist and engineer (b. 1917)\n2016 – Craig Sager, American sports journalist (b. 1951)\n2017 – Heinz Wolff, scientist and TV presenter (b. 1928)\n2017   – Calestous Juma, academic (b. 1953)\n2018 – Eryue He, Chinese historical fiction writer (b.1945) \n2018   – Girma Wolde-Giorgis, President of Ethiopia (b. 1924)\n2020 – Saufatu Sopoanga, Tuvaluan politician, 8th Prime Minister of Tuvalu (b. 1952)\n2024 – Zakir Hussain, Indian tabla player, musical producer, film actor and composer (b. 1951)\n\n\n== Holidays and observances ==\nBill of Rights Day (United States)\n2nd Amendment Day (South Carolina)\nChristian feast day:\nDrina Martyrs\nDrostan (Aberdeen Breviary)\nJohn Horden and Robert McDonald (Episcopal Church (USA))\nMaria Crocifissa di Rosa\nMesmin\nValerian of Abbenza\nVirginia Centurione Bracelli\nDecember 15 (Eastern Orthodox liturgics)\nHomecoming Day (Alderney)\nKingdom Day (Netherlands), moves to December 16 if the 15th is on a Sunday\nZamenhof Day (International Esperanto Community)\n\n\n== References ==\n\n\n== External links ==\n\nBBC: On This Day\n\nThe New York Times: On This Day\nHistorical Events on December 15"
    },
    {
      "id": 1370,
      "userId": 1,
      "content": "Ambrose of Milan (Latin: Aurelius Ambrosius; c. 339 – 4 April 397), venerated as Saint Ambrose, was a theologian and statesman who served as Bishop of Milan from 374 to 397. He expressed himself prominently as a public figure, fiercely promoting Roman Christianity against Arianism and paganism. He left a substantial collection of writings, of which the best known include the ethical commentary De officiis ministrorum (377–391), and the exegetical Exameron (386–390). His preaching, his actions and his literary works, in addition to his innovative musical hymnography, made him one of the most influential ecclesiastical figures of the 4th century.\nAmbrose was serving as the Roman governor of Aemilia-Liguria in Milan when he was unexpectedly made Bishop of Milan in 374 by popular acclamation. As bishop, he took a firm position against Arianism and attempted to mediate the conflict between the emperors Theodosius I and Magnus Maximus. Tradition credits Ambrose with developing an antiphonal chant, known as Ambrosian chant, and for composing the \"Te Deum\" hymn, though modern scholars now reject both of these attributions. Ambrose's authorship on at least four hymns, including the well-known \"Veni redemptor gentium\", is secure; they form the core of the Ambrosian hymns, which includes others that are sometimes attributed to him. He also had a notable influence on Augustine of Hippo (354–430), whom he helped convert to Christianity.\nWestern Christianity identified Ambrose, along with Augustine, Jerome and pope Gregory the Great, as one of the four Great Latin Church Fathers, declared Doctors of the Church in 1298. He is considered a saint by the Catholic Church, Eastern Orthodox Church, Anglican Communion, and various Lutheran denominations, and venerated as the patron saint of Milan and beekeepers.\n\n\n== Background and career ==\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\nLegends about Ambrose had spread through the empire long before his biography was written, making it difficult for modern historians to understand his true character and fairly place his behaviour within the context of antiquity. Most agree he was the personification of his era. This would make Ambrose a genuinely spiritual man who spoke up and defended his faith against opponents, an aristocrat who retained many of the attitudes and practices of a Roman governor, and also an ascetic who served the poor.\n\n\n=== Early life ===\n\nAmbrose was born into a Roman Christian family, of Greek descent, in the year 339. Ambrose himself wrote that he was 53 years old in his letter number 49, which has been dated to 392. He began life in Augusta Treverorum (modern Trier) the capital of the Roman province of Gallia Belgica in what was then northeastern Gaul and is now in the Rhineland-Palatinate in Germany. Scholars disagree on who exactly his father was. His father is sometimes identified with Aurelius Ambrosius, a praetorian prefect of Gaul; but some scholars identify his father as an official named Uranius who received an imperial constitution dated 3 February 339 (addressed in a brief extract from one of the three emperors ruling in 339, Constantine II, Constantius II, or Constans, in the Codex Theodosianus, book XI.5). What does seem certain is that Ambrose was born in Trier and his father was either the praetorian prefect or part of his administration.\nA legend about Ambrose as an infant recounts that a swarm of bees settled on his face while he lay in his cradle, leaving behind a drop of honey. His father is said to have considered this a sign of his future eloquence and honeyed tongue. Bees and beehives often appear in the saint's symbology.\nAmbrose's mother was a woman of intellect and piety. It was probable that she was a member of the Roman family Aurelii Symmachi, which would make Ambrose a cousin of the orator Quintus Aurelius Symmachus. The family had produced one martyr (the virgin Soteris) in its history. Ambrose was the youngest of three children. His siblings were Satyrus, the subject of Ambrose's De excessu fratris Satyri, and Marcellina, who made a profession of virginity sometime between 352 and 355; Pope Liberius himself conferred the veil upon her. Both Ambrose's siblings also became venerated as saints.\nSometime early in the life of Ambrose, his father died. At an unknown later date, his mother left Trier with her three children, and the family moved to Rome. There Ambrose studied literature, law, and rhetoric. He then followed in his father's footsteps and entered public service. Praetorian Prefect Sextus Claudius Petronius Probus first gave him a place as a judicial councillor, and then in about 372 made him governor of the province of Liguria and Emilia, with headquarters in Milan.\n\n\n=== Bishop of Milan ===\nIn 374 the bishop of Milan, Auxentius, an Arian, died, and the Arians challenged the succession. Ambrose went to the church where the election was to take place to prevent an uproar which seemed probable in this crisis. His address was interrupted by a call, \"Ambrose, bishop!\", which was taken up by the whole assembly.\nAmbrose, though known to be Nicene Christian in belief, was considered acceptable to Arians due to the charity he had shown concerning their beliefs. At first, he energetically refused the office of bishop, for which he felt he was in no way prepared: Ambrose was a relatively new Christian who was not yet baptized nor formally trained in theology. Ambrose fled to a colleague's home, seeking to hide. Upon receiving a letter from the Emperor Gratian praising the appropriateness of Rome appointing individuals worthy of holy positions, Ambrose's host gave him up. Within a week, he was baptized, ordained and duly consecrated as the new bishop of Milan. This was the first time in the West that a member of the upper class of high officials had accepted the office of bishop.\nAs bishop, he immediately adopted an ascetic lifestyle, apportioned his money to the poor, donating all of his land, making only provision for his sister Marcellina. While Bishop of Milan, Ambrose carefully cultivated practices that respected local customs and that reflected his spiritual beliefs. He understood the link between a religious leader's life and their ability to model morality for congregants. In his work De Officiis (377–391), he asked, \"How can you consider a man to be better than you when it comes to giving advice if you see that he is worse than you when it comes to morality?\" His humble and upright ways raised his standing among his people even further; it was his popularity with the people that gave him considerable political leverage throughout his career. Upon the unexpected appointment of Ambrose to the episcopate, his brother Satyrus resigned a prefecture in order to move to Milan, where he took over managing the diocese's temporal affairs.\n\n\n=== Arianism ===\nArius (died 336) was a Christian priest who around the year 300 asserted that God the Father must have created the Son, indicating that the Son was a lesser being who was not eternal and of a different \"essence\" from God the Father. This Christology, though contrary to tradition, quickly spread through Egypt, Libya and other Roman provinces. Bishops engaged in the dispute, and the people divided into parties, sometimes demonstrating in the streets in support of one side or the other.\nArianism appealed to many high-level leaders and clergy in both the Western and Eastern empires. Although the western Emperor Gratian (r. 367–383) supported orthodoxy, his younger half brother Valentinian II, who became his colleague in the empire in 375, adhered to the Arian creed. Ambrose sought to refute Arian propositions theologically, but Ambrose did not sway the young prince's position. In the East, Emperor Theodosius I (r. 379–395) likewise professed the Nicene creed; but there were many adherents of Arianism throughout his dominions, especially among the higher clergy.\nIn this state of religious ferment, two leaders of the Arians, bishops Palladius of Ratiaria and Secundianus of Singidunum, confident of numbers, prevailed upon Gratian to call a general council from all parts of the empire. This request appeared so equitable that Gratian complied without hesitation. However, Ambrose feared the consequences and prevailed upon the emperor to have the matter determined by a council of the Western bishops. Accordingly, a synod composed of thirty-two bishops was held at Aquileia in the year 381. Ambrose was elected president and Palladius, being called upon to defend his opinions, declined. A vote was then taken and Palladius and his associate Secundianus were deposed from their episcopal offices.\nAmbrose struggled with Arianism for over half of his term in the episcopate. Ecclesiastical unity was important to the church, but it was no less important to the state, and as a Roman, Ambrose felt strongly about that. Conflict over heresies loomed large in an age of religious ferment comparable to the Reformation of the fourteenth and fifteenth centuries. Orthodox Christianity was determining how to define itself as it faced multiple challenges on both a theological and a practical level, and Ambrose exercised crucial influence at a crucial time.\n\n\n=== Imperial relations ===\nAmbrose had good relations and varying levels of influence with the Roman emperors Gratian, Valentinian II and Theodosius I, but exactly how much influence, what kind of influence, and in what ways, when, has been debated in the scholarship of the late twentieth and early twenty-first centuries.\n\n\n==== Gratian ====\nIt has long been convention to see Gratian and Ambrose as having a personal friendship, putting Ambrose in the dominant role of spiritual guide, but modern scholars now find this view hard to support from the sources. The ancient Christian historian Sozomen (c. 400 – c. 450) is the only ancient source that shows Ambrose and Gratian together in any personal interaction. In that interaction, Sozomen relates that, in the last year of Gratian's reign, Ambrose intruded on Gratian's private hunting party in order to appeal on behalf of a pagan senator sentenced to die. After years of acquaintance, according to professor Neil B. McLynn, this indicates that Ambrose could not take for granted that Gratian would see him, so instead, Ambrose had to resort to such manoeuvrings to make his appeal.\nGratian was personally devout long before meeting Ambrose. Modern scholarship indicates Gratian's religious policies do not evidence capitulation to Ambrose more than they evidence Gratian's own views. Gratian's devotion did lead Ambrose to write a large number of books and letters of theology and spiritual commentary dedicated to the emperor. The sheer volume of these writings and the effusive praise they contain has led many historians to conclude that Gratian was dominated by Ambrose, and it was that dominance that produced Gratian's anti-pagan actions. McLynn asserts that effusive praises were common in everyone's correspondence with the crown. He adds that Gratian's actions were determined by the constraints of the system as much as \"by his own initiatives or Ambrose's influence\".\nMcLynn asserts that the largest influence on Gratian's policy was the profound change in political circumstances produced by the Battle of Adrianople in 378. Gratian had become involved in fighting the Goths the previous year and had been on his way to the Balkans when his uncle and the \"cream of the eastern army\" were destroyed at Adrianople. Gratian withdrew to Sirmium and set up his court there. Several rival groups, including the Arians, sought to secure benefits from the government at Sirmium. In an Arian attempt to undermine Ambrose, whom Gratian had not yet met, Gratian was \"warned\" that Ambrose's faith was suspect. Gratian took steps to investigate by writing to Ambrose and asking him to explain his faith.\nAmbrose and Gratian first met, after this, in 379 during a visit to Milan. The bishop made a good impression on Gratian and his court, which was pervasively Christian and aristocratic – much like Ambrose himself. The emperor returned to Milan in 380 to find that Ambrose had complied with his request for a statement of his faith – in two volumes – known as De Fide: a statement of orthodoxy and of Ambrose' political theology, as well as a polemic against the Arian heresy – intended for public discussion. The emperor had not asked to be instructed by Ambrose, and in De Fide Ambrose states this clearly. Nor was he asked to refute the Arians. He was asked to justify his own position, but in the end, he did all three.\nIt seems that by 382 Ambrose had replaced Ausonius to become a major influence in Gratian's court. Ambrose had not yet become the \"conscience\" of kings he would in the later 380s, but he did speak out against reinstating the Altar of Victory. In 382, Gratian was the first to divert public financial subsidies that had previously supported Rome's cults. Before that year, contributions in support of the ancient customs had continued unchallenged by the state.\n\n\n==== Valentinian II ====\nThe childless Gratian had treated his younger brother Valentinian II like a son. Ambrose, on the other hand, had incurred the lasting enmity of Valentinian II's mother, the Empress Justina, in the winter of 379 by helping to appoint a Nicene bishop in Sirmium. Not long after this, Valentinian II, his mother, and the court left Sirmium; Sirmium had come under Theodosius' control, so they went to Milan which was ruled by Gratian.\nIn 383 Gratian was assassinated at Lyon, in Gaul (France) by Magnus Maximus. Valentinian was twelve years old, and the assassination left his mother, Justina, in a position of something akin to a regent. In 385 (or 386) the emperor Valentinian II and his mother Justina, along with a considerable number of clergy, the laity, and the military, professed Arianism. Conflict between Ambrose and Justina soon followed.\nThe Arians demanded that Valentinian allocate to them two churches in Milan: one in the city (the Basilica of the Apostles), the other in the suburbs (St Victor's). Ambrose refused to surrender the churches. He answered by saying that \"What belongs to God, is outside the emperor's power.\" In this, Ambrose called on an ancient Roman principle: a temple set apart to a god became the property of that god. Ambrose now applied this ancient legal principle to the Christian churches, seeing the bishop, as a divine representative, as guardian of his god's property.\nSubsequently, while Ambrose was performing the Liturgy of the Hours in the basilica, the prefect of the city came to persuade him to give it up to the Arians. Ambrose again refused. Certain deans (officers of the court) were sent to take possession of the basilica by hanging upon it imperial escutcheons. Instead, soldiers from the ranks the emperor had placed around the basilica began pouring into the church, assuring Ambrose of their fidelity. The escutcheons outside the church were removed, and legend says the children tore them to shreds.\nAmbrose refused to surrender the basilica, and sent sharp answers back to his emperor: \"If you demand my person, I am ready to submit: carry me to prison or to death, I will not resist; but I will never betray the church of Christ. I will not call upon the people to succour me; I will die at the foot of the altar rather than desert it. The tumult of the people I will not encourage: but God alone can appease it.\" By Thursday, the emperor gave in, bitterly responding: \"Soon, if Ambrose gives the orders, you will be sending me to him in chains.\"\nIn 386, Justina and Valentinian II received the Arian bishop Auxentius the younger, and Ambrose was again ordered to hand over a church in Milan for Arian usage. Ambrose and his congregation barricaded themselves inside the church, and again the imperial order was rescinded. There was an attempted kidnapping, and another attempt to arrest him and to force him to leave the city. Several accusations were made, but unlike in the case of John Chrysostom, no formal charges were brought. The emperor certainly had the power to do so, and probably did not solely because of Ambrose's popularity with the people and what they might do.\n\nWhen Magnus Maximus usurped power in Gaul (383) and was considering a descent upon Italy, Valentinian sent Ambrose to dissuade him, and the embassy was successful (384). A second, later embassy was unsuccessful. Magnus Maximus entered Italy (386–387) and Milan was taken. Justina and her son fled, but Ambrose remained and had the plate of the church melted for the relief of the poor.After defeating the usurper Maximus at Aquileia in 388 Theodosius handed the western realm back to the young Valentinian II, the seventeen-year-old son of the forceful and hardy Pannonian general Valentinian I and his wife, the Arian Justina. Furthermore, the Eastern emperor remained in Italy for a considerable period to supervise affairs, returning to Constantinople in 391 and leaving behind the Frankish general Arbogast to keep an eye on the young emperor. By May of the following year, Arbogast's ward was dead amidst rumours of both treachery and suicide... \n\n\n==== Theodosius ====\n\nWhile Ambrose was writing De Fide, Theodosius published his own statement of faith in 381 in an edict establishing Nicene Christianity as the only legitimate version of the Christian faith. There is unanimity amongst scholars that this represents the emperor's own beliefs. The aftermath of the death (378) of Valens (Emperor in the East from 364 to 378) had left many questions for the church unresolved, and Theodosius' edict can be seen as an effort to begin addressing those questions. Theodosius' natural generosity was tempered by his pressing need to establish himself and to publicly assert his personal piety.\nOn 28 February 380, Theodosius issued the Edict of Thessalonica, a decree addressed to the city of Constantinople, determining that only Christians who did not support Arian views were catholic and could have their places of worship officially recognized as \"churches\". The Edict opposed Arianism, and attempted to establish unity in Christianity and to suppress heresy. German ancient historian Karl Leo Noethlichs writes that the Edict of Thessalonica was neither anti-pagan nor antisemitic; it did not declare Christianity to be the official religion of the empire; and it gave no advantage to Christians over other faiths.\nLiebeschuetz and Hill indicate that it was not until after 388, during Theodosius' stay in Milan following the defeat of Maximus in 388, that Theodosius and Ambrose first met. \n\nAfter the Massacre of Thessalonica in 390, Theodosius made an act of public penance at Ambrose's behest. Ambrose was away from court during the events at Thessalonica, but after being informed of them, he wrote Theodosius a letter. In that still-existing letter, Ambrose presses for a semi-public demonstration of penitence from the emperor, telling him that, as his bishop, he will not give Theodosius communion until it is done. Wolf Liebeschuetz says \"Theodosius duly complied and came to church without his imperial robes, until Christmas, when Ambrose openly admitted him to communion\".\nFormerly, some scholars credited Ambrose with having an undue influence over Emperor Theodosius I, from this period forward, prompting him toward major anti-pagan legislation beginning in February of 391. However, this interpretation has been heavily disputed since the late-twentieth century. McLynn argues that Theodosius's anti-pagan legislation was too limited in scope for it to be of interest to the bishop. The fabled encounter at the door of the cathedral in Milan, with Ambrose as the mitred prelate braced, blocking Theodosius from entering, which has sometimes been seen as evidence of Ambrose' dominance over Theodosius, has been debunked by modern historians as \"a pious fiction\". There was no encounter at the church door. The story is a product of the imagination of Theodoret, a historian of the fifth century who wrote of the events of 390 \"using his own ideology to fill the gaps in the historical record\".\nThe twenty-first-century view is that Ambrose was \"not a power behind the throne\". The two men did not meet each other frequently, and documents that reveal the relationship between the two are less about personal friendship than they are about negotiations between two formidable leaders of the powerful institutions they represent: the Roman State and the Italian Church. Cameron says there is no evidence that Ambrose was a significant influence on the emperor.\nFor centuries after his death, Theodosius was regarded as a champion of Christian orthodoxy who decisively stamped out paganism. This view was recorded by Theodoret, who is recognized as an unreliable historian, in the century following their deaths. Theodosius's predecessors Constantine (r. 306–337), Constantius (r. 337–361), and Valens had all been semi-Arians. Therefore, it fell to the orthodox Theodosius to receive from Christian literary tradition most of the credit for the final triumph of Christianity. Modern scholars see this as an interpretation of history by orthodox Christian writers more than as a representation of actual history. The view of a pious Theodosius submitting meekly to the authority of the church, represented by Ambrose, is part of the myth that evolved within a generation of their deaths.\n\n\n=== Later years and death ===\n\nIn April 393 Arbogast (magister militum of the West) and his puppet Emperor Eugenius marched into Italy to consolidate their position against Theodosius I and his son, Honorius, now appointed Augustus to govern the western portion of the empire. Arbogast and Eugenius courted Ambrose's support by very obliging letters; but before they arrived at Milan, he had retired to Bologna, where he assisted at the translation of the relics of Saints Vitalis and Agricola. From there he went to Florence, where he remained until Eugenius withdrew from Milan to meet Theodosius in the Battle of the Frigidus in early September 394.\nSoon after acquiring the undisputed possession of the Roman Empire, Theodosius died at Milan in 395, and Ambrose gave the eulogy. Two years later (4 April 397) Ambrose also died. He was succeeded as bishop of Milan by Simplician. Ambrose's body may still be viewed in the church of Saint Ambrogio in Milan, where it has been continuously venerated – along with the bodies identified in his time as being those of Saints Gervase and Protase.\nAmbrose is remembered in the calendar of the Roman Rite of the Catholic Church on 7 December, and is also honoured in the Church of England and in the Episcopal Church on 7 December.\n\n\n== Character ==\nIn 1994, Neil B. McLynn wrote a complex study of Ambrose that focused on his politics and was intended to \"demonstrate that Ambrose viewed community as a means to acquire personal political power\". Subsequent studies of how Ambrose handled his episcopal responsibilities, his Nicene theology and his dealings with the Arians in his episcopate, his pastoral care, his commitment to community, and his personal asceticism, have mitigated this view. \n\nAll of Ambrose's writings are works of advocacy for Nicene Christianity, and even his political views and actions were closely related to his religion. He was rarely, if ever, concerned about simply recording what had happened; he did not write to reveal his inner thoughts and struggles; he wrote to advocate for his God. Boniface Ramsey writes that it is difficult \"not to posit a deep spirituality in a man\" who wrote on the mystical meanings of the Song of Songs and wrote many extraordinary hymns. Despite an abiding spirituality, Ambrose had a generally straightforward manner, and a practical rather than a speculative tendency in his thinking. De Officiis is a utilitarian guide for his clergy in their daily ministry in the Milanese church rather than \"an intellectual tour de force\".\nChristian faith in the third century developed the monastic lifestyle which subsequently spread into the rest of Roman society in a general practice of virginity, voluntary poverty and self-denial for religious reasons. This lifestyle was embraced by many new converts, including Ambrose, even though they did not become actual monks.\nThe bishops of this era had heavy administrative responsibilities, and Ambrose was also sometimes occupied with imperial affairs, but he still fulfilled his primary responsibility to care for the well-being of his flock. He preached and celebrated the Eucharist multiple times a week, sometimes daily, and dealt directly with the needs of the poor, as well as widows and orphans, \"virgins\" (nuns), and his own clergy. He replied to letters personally, practised hospitality, and made himself available to the people. \n\nAmbrose had the ability to maintain good relationships with all kinds of people. Local church practices varied quite a bit from place to place at this time, and as the bishop, Ambrose could have required that everyone adapt to his way of doing things. It was his place to keep the churches as united as possible in both ritual and belief. Instead, he respected local customs, adapting himself to whatever practices prevailed, instructing his mother to do the same. As bishop, Ambrose undertook many different labours in an effort to unite people and \"provide some stability during a period of religious, political, military, and social upheavals and transformations\".\nBrown says Ambrose \"had the makings of a faction fighter\". While he got along well with most people, Ambrose was not averse to conflict and even opposed emperors with a fearlessness born of self-confidence and a clear conscience and not from any belief he would not suffer for his decisions. Having begun his life as a Roman aristocrat and a governor, it is clear that Ambrose retained the attitudes and practices of Roman governance even after becoming a bishop.\nHis acts and writings show he was quite clear about the limits of imperial power over the church's internal affairs including doctrine, moral teaching, and governance. He wrote to Valentinian: \"In matters of faith bishops are the judges of Christian emperors, not emperors of bishops.\" (Epistle 21.4). He also famously said to an Arian bishop chosen by the emperor, \"The emperor is in the church, not over the church.\" (Sermon Against Auxentius, 36). Ambrose's acts and writings \"created a sort of model which was to remain valid in the Latin West for the relations of the Church and the Christian State. Both powers stood in a basically positive relationship to each other, but the innermost sphere of the Church's life--faith, the moral order, ecclesiastical discipline--remained withdrawn from the State's influence.\"\nAmbrose was also well aware of the limits of his power. At the height of his career as a venerable, respected and well-loved bishop in 396, imperial agents marched into his church, pushing past him and his clergy who had crowded the altar to protect a political suspect from arrest, and dragged the man from the church in front of Ambrose who could do nothing to stop them. \"When it came to the central functions of the Roman state, even the vivid Ambrose was a lightweight\".\n\n\n=== Attitude towards Jews ===\nAmbrose is recorded on occasions as taking a hostile attitude towards Jews, for example in 388, when the Emperor Theodosius I was informed that a crowd of Christians had retaliated against the local Jewish community by destroying the synagogue at Callinicum on the Euphrates. The synagogue most probably existed within the fortified town to serve the soldiers stationed there, and Theodosius ordered that the offenders be punished and that the synagogue be rebuilt at the expense of the bishop. Ambrose wrote to the emperor arguing against this, basing his argument on two assertions: first, if the bishop obeyed the order, it would be a betrayal of his faith, and second, if the bishop instead refused to obey the order, he would become a martyr and create a scandal embarrassing the emperor. Ambrose, referring to a prior incident where Magnus Maximus issued an edict censuring Christians in Rome for burning down a Jewish synagogue, warned Theodosius that the people, in turn, exclaimed \"the emperor has become a Jew\", implying that Theodosius would receive the same lack of support from the people. Theodosius rescinded the order concerning the bishop.\nThat was not enough for Ambrose, however, and when Theodosius next visited Milan Ambrose confronted him directly in an effort to get him to drop the entire case. McLynn argues that Ambrose failed to win the emperor's sympathy and was mostly excluded from his counsels thereafter. The Callinicum affair was not an isolated incident. Generally speaking, however, while McLynn says it makes Ambrose look like a bully and a bigot to modern eyes, scholars also agree that Ambrose's attitudes toward the Jews cannot be fairly summarized in one sentence, as not all of Ambrose's attitudes toward Jews were negative.\nFor example, Ambrose makes extensive and appreciative use of the works of a Jew, Philo of Alexandria, in his own writings, treating Philo as one of the \"faithful interpreters of the Scriptures\". Philo was an educated man of some standing and a prolific writer during the era of Second Temple Judaism. Forty–three of his treatises have been preserved, and these by Christians, rather than Jews. Philo became foundational in forming the Christian literary view on the six days of creation through Basil's Hexaemeron. Eusebius, the Cappadocian Fathers, and Didymus the Blind appropriated material from Philo as well, but none did so more than Ambrose. As a result of these extensive references, Philo was accepted into the Christian tradition as an honorary Church Father. \"In fact, one Byzantine catena even refers to him as 'Bishop Philo'. This high regard for Philo even led to a number of legends of his conversion to Christianity, although this assertion stands on very dubious evidence\". Ambrose also used Josephus, Maccabees, and other Jewish sources for his writings. He praises some individual Jews. Ambrose tended to write negatively of all non-Nicenes as if they were all in one category. This served a rhetorical purpose in his writing and should be considered accordingly.\n\n\n=== Attitude towards pagans ===\n\nModern scholarship indicates that paganism was a lesser concern than heresy for Christians in the fourth and fifth centuries, including Ambrose, but it was still a concern. Writings of this period were commonly hostile and often contemptuous toward paganism which Christianity saw as already defeated in Heaven. The great Christian writers of the third to fifth centuries attempted to discredit the continuation of these \"defeated practices\" by searching pagan writings, \"particularly those of Varro, for everything that could be regarded by Christian standards as repulsive and irreligious.\" Ambrose' work reflects this triumphalism.\nThroughout his time in the episcopate, Ambrose was active in his opposition to any state sponsorship of pagan cults. When Gratian ordered the Altar of Victory to be removed, it roused the aristocracy of Rome to send a delegation to the emperor to appeal against the decision, but Pope Damasus I induced Christian senators to petition against it, and Ambrose blocked the delegates from obtaining an audience with the emperor. Under Valentinian II, an effort was made to restore the Altar of Victory to its ancient station in the hall of the Roman Senate and to again provide support for the seven Vestal Virgins. The pagan party was led by the refined senator Quintus Aurelius Symmachus, who used all his prodigious skill and artistry to create a marvellous document full of the maiestas populi Romani. Hans Lietzmann writes that \"Pagans and Christians alike were stirred by the solemn earnestness of an admonition which called all men of goodwill to the aid of a glorious history, to render all worthy honour to a world that was fading away\".\nThen Ambrose wrote to Valentinian asserting that the emperor was a soldier of God – not simply a personal believer, but one bound by his position to serve the faith; under no circumstances could he agree to something that would promote the worship of idols. Ambrose held up the example of Valentinian's brother, Gratian, reminding Valentinian that the commandment of God must take precedence. The bishop's intervention led to the failure of Symmachus' appeal.\nIn 389, Ambrose stepped in against a pagan senatorial delegation who wished to see the emperor Theodosius I. Although Theodosius refused their requests, he was irritated at the bishop's presumption and refused to see him for several days. Later, Ambrose wrote a letter to the emperor Eugenius complaining that some gifts the latter had bestowed on pagan senators could be used for funding pagan cults.\n\n\n== Theology ==\n\nAmbrose joins Augustine, Jerome, and Gregory the Great as one of the Latin Doctors of the Church. Theologians compare him with Hilary, who they claim fell short of Ambrose's administrative excellence but demonstrated greater theological ability. He succeeded as a theologian despite his juridical training and his comparatively late handling of biblical and doctrinal subjects.\nAmbrose's intense episcopal consciousness furthered the growing doctrine of the Church and its sacerdotal ministry including teaching, leading services, administering sacraments, and giving pastoral advice. He found a proper balance between offering sacraments as mysterious ways of encountering God and sacramentalism, the emphasis on ritual for ritual's sake,  prevalent elsewhere. He engaged the prevalent asceticism of the day, continuing the Stoic and Ciceronian training of his youth, which enabled him to promulgate a lofty standard of Christian ethics. Thus we have the De officiis ministrorum, De viduis, De virginitate and De paenitentia.\nAmbrose displayed a kind of liturgical flexibility that kept in mind that liturgy was a tool to serve people in worshiping God, and ought not to become a rigid entity that is invariable from place to place. His advice to Augustine of Hippo on this point was to follow local liturgical custom. \"When I am at Rome, I fast on a Saturday; when I am at Milan, I do not. Follow the custom of the church where you are.\" Thus Ambrose refused to be drawn into a false conflict over which particular local church had the \"right\" liturgical form where there was no substantial problem. His advice has remained in the English language as the saying, \"When in Rome, do as the Romans do.\"\n\n\n=== Eschatology ===\nSome scholars argue that Ambrose was a Christian universalist. It has been noted that Ambrose's theology was significantly influenced by that of Origen and Didymus the Blind, two other early Christian universalists. One quotation cited in favour of this belief is:\n\nOur Savior has appointed two kinds of resurrection in the Apocalypse. 'Blessed is he that hath part in the first resurrection,' for such come to grace without the judgment. As for those who do not come to the first, but are reserved unto the second resurrection, these shall be disciplined until their appointed times, between the first and the second resurrection.\nOne could interpret this passage as being another example of the Christian belief in a general resurrection (that both those in Heaven and in Hell undergo a bodily resurrection), or an allusion to purgatory (that some destined for Heaven must first undergo a phase of purification). Some other works by Ambrose could potentially be seen as teaching the mainstream view of salvation. For example:\n\nThe Jews feared to believe in manhood taken up into God, and therefore have lost the grace of redemption, because they reject that on which salvation depends.\nThis could be interpreted as something which is not eschatological but rather rhetorical or conditional on the state of repentance. The passage most often cited in support of Ambrose supposed belief in apokatastasis is his commentary on 1 Corinthians 15, it reads:\n\nA unity of power puts aside all idea of a degrading subjection. His giving up of power, and His victory as conqueror won over death, have not lessened His power. Obedience works out subjection. Christ has taken obedience upon Himself, obedience even to taking on Him our flesh, the cross even to gaining our salvation. Thus where the work lies, there too is the Author of the work. When therefore, all things have become subject to Christ, through Christ's obedience, so that all bend their knees in His name, then He Himself will be all in all. For now, since all do not believe, all do not seem to be in subjection. But when all have believed and done the will of God, then Christ will be all and in all. And when Christ is all and in all, then will God be all and in all; for the Father abides ever in the Son. How, then, is He shown to be weak, Who redeemed the weak?\nOther scholars interpret Ambrose's soteriology to be in agreement with Jerome of Stridon and the anonymous individuals whom Augustine criticized in his treatise \"on faith and works\", who argued that while the unbelievers would experience eternal judgement, all Christians who have believed in Jesus will be reunited to God at some point, even if they have sinned and fallen away.\n\n\n=== Giving to the poor ===\nIn De Officiis, the most influential of his surviving works, and one of the most important texts of patristic literature, he reveals his views connecting justice and generosity by asserting these practices are of mutual benefit to the participants. Ambrose draws heavily on Cicero and the biblical book of Genesis for this concept of mutual inter-dependence in society. In the bishop's view, it is concern for one another's interests that binds society together. Ambrose asserts that avarice leads to a breakdown in this mutuality, therefore avarice leads to a breakdown in society itself. In the late 380s, the bishop took the lead in opposing the greed of the elite landowners in Milan by starting a series of pointed sermons directed at his wealthy constituents on the need for the rich to care for the poor.\nSome scholars have suggested Ambrose's endeavours to lead his people as both a Roman and a Christian caused him to strive for what a modern context would describe as a type of communism or socialism. He was not just interested in the church but was also interested in the condition of contemporary Italian society. Ambrose considered the poor not a distinct group of outsiders, but a part of a united people to be stood with in solidarity. Giving to the poor was not to be considered an act of generosity towards the fringes of society but a repayment of resources that God had originally bestowed on everyone equally and that the rich had usurped. He defines justice as providing for the poor whom he describes as our \"brothers and sisters\" because they \"share our common humanity\".\n\n\n=== Mariology ===\nThe theological treatises of Ambrose of Milan would come to influence Popes Damasus, Siricius and Leo XIII. Central to Ambrose is the virginity of Mary and her role as Mother of God.\n\nThe virgin birth is worthy of God. Which human birth would have been more worthy of God, than the one in which the Immaculate Son of God maintained the purity of his immaculate origin while becoming human?\nWe confess that Christ the Lord was born from a virgin, and therefore we reject the natural order of things. Because she conceived not from a man but from the Holy Spirit.\nChrist is not divided but one. If we adore him as the Son of God, we do not deny his birth from the virgin. ... But nobody shall extend this to Mary. Mary was the temple of God but not God in the temple. Therefore, only the one who was in the temple can be worshipped.\nYes, truly blessed for having surpassed the priest (Zechariah). While the priest denied, the Virgin rectified the error. No wonder that the Lord, wishing to rescue the world, began his work with Mary. Thus she, through whom salvation was being prepared for all people, would be the first to receive the promised fruit of salvation.\nAmbrose viewed celibacy as superior to marriage and saw Mary as the model of virginity.\n\n\n=== Augustine ===\nAmbrose studied theology with Simplician, a presbyter of Rome. Using his excellent knowledge of Greek, which was then rare in the West, Ambrose studied the Old Testament and Greek authors like Philo, Origen, Athanasius, and Basil of Caesarea, with whom he was also exchanging letters. Ambrose became a famous rhetorician whom Augustine came to hear speak. Augustine wrote in his Confessions that Faustus, the Manichean rhetorician, was a more impressive speaker, but the content of Ambrose's sermons began to affect Augustine's faith. Augustine sought guidance from Ambrose and again records in his Confessions that Ambrose was too busy to answer his questions. In a passage of Augustine's Confessions in which Augustine wonders why he could not share his burden with Ambrose, he comments: \"Ambrose himself I esteemed a happy man, as the world counted happiness, because great personages held him in honour. Only his celibacy appeared to me a painful burden.\" Simplician regularly met with Augustine, however, and Augustine writes of Simplician's \"fatherly affection\" for him. It was Simplician who introduced Augustine to Christian Neoplatonism. It is commonly understood in the Christian tradition that Ambrose baptized Augustine.\nIn this same passage of Augustine's Confessions is an anecdote which bears on the history of reading:\n\nWhen [Ambrose] read, his eyes scanned the page and his heart sought out the meaning, but his voice was silent and his tongue was still. Anyone could approach him freely and guests were not commonly announced, so that often, when we came to visit him, we found him reading like this in silence, for he never read aloud.\nThis is a celebrated passage in modern scholarly discussion. The practice of reading to oneself without vocalizing the text was less common in antiquity than it has since become. In a culture that set a high value on oratory and public performances of all kinds, in which the production of books was very labour-intensive, the majority of the population was illiterate, and where those with the leisure to enjoy literary works also had slaves to read for them, written texts were more likely to be seen as scripts for recitation than as vehicles of silent reflection. However, there is also evidence that silent reading did occur in antiquity and that it was not generally regarded as unusual.\n\n\n== Music ==\n\nAmbrose's writings extend past literature and into music, where he was an important innovator in early Christian hymnography. His contributions include the \"successful invention of Christian Latin hymnody\", while the hymnologist Guido Maria Dreves designated him to be \"The Father of church hymnody\". He was not the first to write Latin hymns; the Bishop Hilary of Poitiers had done so a few decades before. However, the hymns of Hilary are thought to have been largely inaccessible because of their complexity and length. Only fragments of hymns from Hilary's Liber hymnorum exist, making those of Ambrose the earliest extant complete Latin hymns. The assembling of Ambrose's surviving oeuvre remains controversial; the almost immediate popularity of his style quickly prompted imitations, some which may even date from his lifetime. There are four hymns for which Ambrose's authorship is universally accepted, as they are attributed to him by Augustine:\n\n\"Aeterne rerum conditor\"\n\"Deus creator omnium\"\n\"Iam surgit hora tertia\"\n\"Veni redemptor gentium\" (also known as \"Intende qui regis Israel\")\nEach of these hymns has eight four-line stanzas and is written in strict iambic tetrameter (that is 4 × 2 syllables, each iamb being two syllables). Marked by dignified simplicity, they served as a fruitful model for later times. Scholars such as the theologian Brian P. Dunkle have argued for the authenticity of as many as thirteen other hymns, while the musicologist James McKinnon contends that further attributions could include \"perhaps some ten others\". Ambrose is traditionally credited but not actually known to have composed any of the repertory of Ambrosian chant also known simply as \"antiphonal chant\", a method of chanting where one side of the choir alternately responds to the other. Although Ambrosian chant was named in his honour, no Ambrosian-chant melodies can be attributed to Ambrose. With Augustine, Ambrose was traditionally credited with composing the hymn \"Te Deum\". Since the hymnologist Guido Maria Dreves in 1893, however, scholars have dismissed this attribution.\n\n\n== Writings ==\n\nSource: All works are originally in Latin. Following each is where it may be found in a standard compilation of Ambrose's writings. His first work was probably De paradiso (377–378). Most have approximate dates, and works such as De Helia et ieiunio (377–391), Expositio evangelii secundum Lucam (377–389) and De officiis ministrorum (377–391) have been given a wide variety of datings by scholars. His best known work is probably De officiis ministrorum (377–391), while the Exameron (386–390) and De obitu Theodosii (395) are among his most noted works. In matters of exegesis he is, like Hilary, an Alexandrian. In dogma he follows Basil of Caesarea and other Greek authors, but nevertheless gives a distinctly Western cast to the speculations of which he treats. This is particularly manifest in the weightier emphasis which he lays upon human sin and divine grace, and in the place which he assigns to faith in the individual Christian life. There has been debate on the attribution of some writings: for example De mysteriis is usually attributed to Ambrose, while the related De sacramentis is written in a different style with some silent disagreements, so there is less consensus over its author. This latter work was occasionally identified as being by St. Augustine, though this is erroneous.\n\n\n=== Exegesis ===\nExameron [The Six Days of Creation]. Vol. 6 books. 386–390. (PL, 14.133–288; CSEL, 32.1.3–261; FC, 42.3–283)\nDe paradiso [On Paradise]. 377–378. (PL, 14.291–332; CSEL, 32.1.265–336; FC, 42.287–356)\nDe Cain et Abet [On Cain and Abel]. 377–378. (PL, 14.333–80; CSEL, 32.1.339–409; FC, 42.359–437)\nDe Noe [On Noah]. 378–384. (PL, 14.381–438; CSEL, 32.1.413–97)\nDe Abraham [On Abraham]. Vol. 2 books. 380s. (PL, 14.441–524; CSEL, 32.1.501–638)\nDe Isaac et anima [On Isaac and the Soul]. 387–391. (PL, 14.527–60; CSEL, 32.1.641–700; FC, 65.9–65.)\nDe bono mortis [On the Good of Death]. 390. (PL, 14.567–96; CSEL, 32.1.707–53; FC, 65.70–113)\nDe fuga saeculi [On Flight from the World]. 391–394. (PL, 14.597–624; CSEL, 32.2.163–207; FC, 65.281–323)\nDe Iacob et vita beata [On Iacob and the Happy Life]. 386–388. (PL, 14.627–70; CSEL, 32.2.3–70; FC, 65.119–84)\nDe Joseph [On Joseph]. 387–388. (PL, 14.673–704; CSEL, 32.2.73–122; FC, 65.187–237)\nDe patriarchis [On the Patriarchs]. 391. (PL, 14.707–28; CSEL, 32.2.125–60; FC, 65.243–75)\nDe Helia et ieiunio [On Elijah and Fasting]. 377–391. (PL, 14.731–64; CSEL, 32.2.411–65)\nDe Nabuthae [On Naboth]. 389. (CSEL, 32.2.469)\nDe Tobia [On Tobias]. 376–390. (PL, 14.797–832; CSEL, 32.2.519–573)\nDe interpellatione Iob et David [The Prayer of Job and David]. Vol. 4 books. 383–394. (PL, 14.835–90; CSEL, 32.2.211–96; FC, 65.329–420)\nApologia prophetae David [A Defense of the Prophet David]. 387. (PL, 14.891–926; CSEL, 32.2.299–355)\nEnarrationes in xii psalmos davidicos [Explanations of Twelve Psalms of David]. (PL, 14.963–1238; CSEL, 64)\nExpositio in Psalmum cxviii [A Commentary on Psalm 118]. 386–390. (PL, 15.1197–1526; CSEL, 62)\nExpositio Esaiae prophetae [A Commentary on the Prophet Isaiah]. (CCSL, 14.405–8)\nExpositio evangelii secundum Lucam [A Commentary on the Gospel according to Luke]. Vol. 10 books. 377–389. (PL, 15.1527–1850; CSEL, 32.4; CCSL, 14.1–400)\n\n\n=== Moral and ascetical commentary ===\nDe officiis ministrorum [On the Duties of Ministers]. 377–391. (PL, 16.25–194)\nDe virginibus [On Virgins]. 377.\nDe viduis [On Widows]. 377. (PL, 16.247–76)\nDe virginitate [On Virginity]. 378. (PL, 16.279–316)\nDe institutione virginis [An Instruction for a Virgin]. 391–392. (PL, 16.319–43)\nExhortatio virginitatis [In Praise of Virginity]. 393–395. (PL, 16.351–80)\n\n\n=== Dogmatic writings ===\nDe fide [On the Faith]. Vol. 5 books. 378–380. (PL, 16.549–726; CSEL, 78)\nDe Spiritu Sancto [On the Holy Spirit]. 381. (PL, 16.731–850; CSEL, 79.15–222; FC, 44.35–214)\nDe incarnationis dominicae sacramento [On the Sacrament of the Lord's Incarnation]. 381–382. (PL, 16.853–84; CSEL, 79.223–81; FC, 44.219–62)\nExplanatio symboli ad initiandos [An Explanation of the Creed for Those about to be Baptised]. PL, 17.1193–96; CSEL, 73.1–12)\nDe sacramentis [On the Sacraments]. Vol. 6 books. 390. (PL, 16.435–82; CSEL, 73.13–116; FC, 44.269–328)\nDe mysteriis [On the Mysteries].\nDe paenitentia [On Repentance]. 384–394. (PL, 16.485–546; CSEL, 73.117–206)\nExpositio fidei [An Explanation of the Faith]. (PL, 16.847–50)\nDe sacramento regenerationis sive de philosophia [On the Sacrament of Regeneration, or On Philosophy]. (fragmented; CSEL, 11.131)\n\n\n=== Sermons ===\nDe excessu fratris [On the Death of his Brother]. 375–378. (PL, 16.1345–1414; CSEL, 73.207–325; FC, 22.161–259)\nDe obitu Valentiniani [On the Death of Valentinian]. (PL, 16.1417–44; CSEL, 73.327–67; FC, 22.265–99)\nDe obitu Theodosii [On the Death of Theodosius]. 25 February 395. (PL, 16.1447–88; CSEL, 73.369–401; FC, 22.307–332)\nContra Auxentium de basilicis tradendis [Against Auxentius on Handing over the Basilicas]. 386. (PL, 16.1049–53)\n\n\n=== Others ===\n91 letters\n\n\n== Editions ==\n\nThe history of the editions of the works of St. Ambrose is a long one. Erasmus edited them in four tomes at Basle (1527). A valuable Roman edition was brought out in 1580, in five volumes, the result of many years' labour; it was begun by Sixtus V, while yet the monk Felice Peretti. Prefixed to it is the life of St. Ambrose composed by Baronius for his Annales Ecclesiastici. The excellent Maurist edition of du Frische and Le Nourry appeared at Paris (1686–90) in two folio volumes; it was twice reprinted at Venice (1748–51, and 1781–82). The latest edition of the writings of St. Ambrose is that of Paolo Angelo Ballerini (Milan, 1878) in six folio volumes.\n\n\n=== Standard editions ===\nMigne, Jacques Paul, ed. (1845). Patrologia Latina (in Latin). Vol. 14–17. Paris. Based on the Maurist edition published in Paris by Jacques Du Frische and Denis-Nicolas Le Nourry.\nCorpus Scriptorum Ecclesiasticorum Latinorum (in Latin). Vol. 11, 32, 62, 64, 73, 78–79. Vienna: Imperial Academy of Sciences in Vienna. 1866.\nBallerini, P. A., ed. (1875–1883). Opera omnia (in Latin). Milan.{{cite book}}:  CS1 maint: location missing publisher (link) Based on the Maurist edition published in Paris by Jacques Du Frische and Denis-Nicolas Le Nourry.\nCatholic University of America, ed. (1947). Fathers of the Church. Vol. 22, 42, 44, 65. Washington DC.: Catholic University of America Press. OCLC 8110481.\nCorpus Christianorum. Vol. 14. Turnhout: Brepols. 1953. OCLC 1565173.\n\n\n=== Latin ===\nHexameron, De paradiso, De Cain, De Noe, De Abraham, De Isaac, De bono mortis – ed. C. Schenkl 1896, Vol. 32/1 (In Latin)\nDe Iacob, De Ioseph, De patriarchis, De fuga saeculi, De interpellatione Iob et David, De apologia prophetae David, De Helia, De Nabuthae, De Tobia – ed. C. Schenkl 1897, Vol. 32/2\nExpositio evangelii secundum Lucam – ed. C. Schenkl 1902, Vol. 32/4\nExpositio de psalmo CXVIII – ed. M. Petschenig 1913, Vol. 62; editio altera supplementis aucta – cur. M. Zelzer 1999\nExplanatio super psalmos XII – ed. M. Petschenig 1919, Vol. 64; editio altera supplementis aucta – cur. M. Zelzer 1999\nExplanatio symboli, De sacramentis, De mysteriis, De paenitentia, De excessu fratris Satyri, De obitu Valentiniani, De obitu Theodosii – ed. Otto Faller 1955, Vol. 73\nDe fide ad Gratianum Augustum – ed. Otto Faller 1962, Vol. 78\nDe spiritu sancto, De incarnationis dominicae sacramento – ed. Otto Faller 1964, Vol. 79\nEpistulae et acta – ed. Otto Faller (Vol. 82/1: lib. 1–6, 1968); Otto Faller, M. Zelzer (Vol. 82/2: lib. 7–9, 1982); M. Zelzer (Vol. 82/3: lib. 10, epp. extra collectionem. gesta concilii Aquileiensis, 1990); Indices et addenda – comp. M. Zelzer, 1996, Vol. 82/4\n\n\n=== English ===\nH. Wace and P. Schaff, eds, A Select Library of Nicene and Post–Nicene Fathers of the Christian Church, 2nd ser., Vol. X [Contains translations of De Officiis (under the title De Officiis Ministrorum), De Spiritu Sancto (On the Holy Spirit), De excessu fratris Satyri (On the Decease of His Brother Satyrus), Exposition of the Christian Faith, De mysteriis (Concerning Mysteries), De paenitentia (Concerning Repentance), De virginibus (Concerning Virgins), De viduis (Concerning Widows), and a selection of letters]\nSt. Ambrose \"On the mysteries\" and the treatise on the sacraments by an unknown author, translated by T Thompson, (London: SPCK, 1919) [translations of De sacramentis and De mysteriis; rev edn published 1950]\nS. Ambrosii De Nabuthae: a commentary, translated by Martin McGuire, (Washington, DC: The Catholic University of America, 1927) [translation of On Naboth]\nS. Ambrosii De Helia et ieiunio: a commentary, with an introduction and translation, Sister Mary Joseph Aloysius Buck, (Washington, DC: The Catholic University of America, 1929) [translation of On Elijah and Fasting]\nS. Ambrosii De Tobia: a commentary, with an introduction and translation, Lois Miles Zucker, (Washington, DC: The Catholic University of America, 1933) [translation of On Tobit]\nFuneral orations, translated by LP McCauley et al., Fathers of the Church vol 22, (New York: Fathers of the Church, Inc., 1953) [by Gregory of Nazianzus and Ambrose],\nLetters, translated by Mary Melchior Beyenka, Fathers of the Church, vol 26, (Washington, DC: Catholic University of America, 1954) [Translation of letters 1–91]\nSaint Ambrose on the sacraments, edited by Henry Chadwick, Studies in Eucharistic faith and practice 5, (London: AR Mowbray, 1960)\nHexameron, Paradise, and Cain and Abel, translated by John J Savage, Fathers of the Church, vol 42, (New York: Fathers of the Church, 1961) [contains translations of Hexameron, De paradise, and De Cain et Abel]\nSaint Ambrose: theological and dogmatic works, translated by Roy J. Deferrari, Fathers of the church vol 44, (Washington: Catholic University of American Press, 1963) [Contains translations of The mysteries, (De mysteriis) The holy spirit, (De Spiritu Sancto), The sacrament of the incarnation of Our Lord, (De incarnationis Dominicae sacramento), and The sacraments]\nSeven exegetical works, translated by Michael McHugh, Fathers of the Church, vol 65, (Washington: Catholic University of America Press, 1972) [Contains translations of Isaac, or the soul, (De Isaac vel anima), Death as a good, (De bono mortis), Jacob and the happy life, (De Iacob et vita beata), Joseph, (De Ioseph), The patriarchs, (De patriarchis), Flight from the world, (De fuga saeculi), The prayer of Job and David, (De interpellatione Iob et David).]\nHomilies of Saint Ambrose on Psalm 118, translated by Íde Ní Riain, (Dublin: Halcyon Press, 1998) [translation of part of Explanatio psalmorum]\nAmbrosian hymns, translated by Charles Kraszewski, (Lehman, PA: Libella Veritatis, 1999)\nCommentary of Saint Ambrose on twelve psalms, translated by Íde M. Ní Riain, (Dublin: Halcyon Press, 2000) [translations of Explanatio psalmorum on Psalms 1, 35–40, 43, 45, 47–49]\nOn Abraham, translated by Theodosia Tomkinson, (Etna, CA: Center for Traditionalist Orthodox Studies, 2000) [translation of De Abraham]\nDe officiis, edited with an introduction, translation, and commentary by Ivor J Davidson, 2 vols, (Oxford: OUP, 2001) [contains both Latin and English text]\nCommentary of Saint Ambrose on the Gospel according to Saint Luke, translated by Íde M. Ní Riain, (Dublin: Halcyon, 2001) [translation of Expositio evangelii secundum Lucam]\nAmbrose of Milan: political letters and speeches, translated with an introduction and notes by JHWG Liebschuetz, (Liverpool: Liverpool University Press, 2005) [contains Book Ten of Ambrose's Letters, including the oration on the death of Theodosius I; Letters outside the Collection (Epistulae extra collectionem); Letter 30 to Magnus Maximus; The oration on the death of Valentinian II (De obitu Valentiniani).]\nSeveral of Ambrose's works have recently been published in the bilingual Latin-German Fontes Christiani series (currently edited by Brepols).\n\n\n== See also ==\n\nAmbrosian hymnography\nAmbrosian Liturgy and Rite\nSaint Ambrose Basilica, Milan\nChurch Fathers\nSt. Ambrose Cathedral, Linares\nSaint Ambrose University, Davenport, Iowa\nAmbrose University College, Calgary, Alberta\nHenry Becher, early English translator of St. Ambrose\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Works cited ===\n\n\n== Further reading ==\nByfield, Ted (2003). Darkness Descends: A.D. 350 to 565, the Fall of the Western Roman Empire. Christian History Project. ISBN 978-0-9689873-3-9.\nDeferrari, Roy J., ed. (1954–1972). The Fathers of the Church. Vol. 26, 42, 44, 65. New York: Fathers of the Church.\nDudden, F. Homes (1935). The Life and Times of St. Ambrose. Oxford: Clarendon Press.\nFord, Coleman M.; Wilhite, Shawn J. (2024). Ancient Wisdom for the Care of Souls. Wheaton, Illinois: Crossway. pp. 57–71. ISBN 978-1-4335-7549-5.\nGilliard, Frank D. (1984). \"Senatorial Bishops in the Fourth Century\". Harvard Theological Review. 77 (2): 153–175. doi:10.1017/s0017816000014279. S2CID 162747415.\nKing, N. Q. (1960). The Emperor Theodosius and the Establishment of Christianity. Philadelphia: Westminster Press.\nPaulinus (1952). Life of St. Ambrose by Paulinus. Translated by John A. Lacy. New York: Fathers of the Church.\n\"Ambrose\". Patron Saints Index. SPQN. January 2009. Retrieved 8 December 2012.\nvon Campenhausen, Hans (1964). Men Who Shaped the Western Church. Translated by Hoffman, Manfred. New York: Harper and Row.\n\n\n== External links ==\n\nWorks by Ambrose at Project Gutenberg\nWorks by or about Ambrose at the Internet Archive\nWorks by Ambrose at LibriVox (public domain audiobooks) \nChristian Classics Ethereal Library, Works of Ambrose of Milan\nHymni Ambrosii (Latin)\nEarlyChurch.org.uk Extensive bibliography\nAmbrose's works: text, concordances and frequency list\nLetters of Ambrose - All extant letters of Ambrose with summaries and English translations from Fourth-Century Christianity.\nAmbrose at The Online Library of Liberty\nOpera Omnia\nAmbrose in Anglo-Saxon England, with Pseudo-Ambrose and Ambrosiaster, Contributions to Sources of Anglo-Saxon Literary Culture, by Dabney Anderson Bankert, Jessica Wegmann, and Charles D. Wright.\n\"Saint Ambrose\" at the Christian Iconography website\n\"Of St. Ambrose\" from the Caxton translation of the Golden Legend\nAugustine's account of the penitence of Theodosius\nFree scores by Ambrose at the International Music Score Library Project (IMSLP)"
    },
    {
      "id": 4752,
      "userId": 1,
      "content": "Brasília ( brə-ZIL-ee-ə; Portuguese: [bɾaˈziliɐ, bɾaˈziljɐ] ) is the capital of Brazil and Federal District. Located in the Brazilian highlands in the country's Central-West region, it was founded by President Juscelino Kubitschek on 21 April 1960, to replace Rio de Janeiro as the national capital. Brasília is Brazil's third-most populous city after São Paulo and Rio de Janeiro, with a population of 2.8 million. Among major Latin American cities, it has the highest GDP per capita.\nBrasília is a planned city developed by Lúcio Costa, Oscar Niemeyer and Joaquim Cardozo in 1956 in a scheme to move the capital from Rio de Janeiro to a more central location. The landscape architect was Roberto Burle Marx. The city's design divides it into numbered blocks as well as sectors for specified activities, such as the Hotel Sector, the Banking Sector, and the Embassy Sector. Brasília was inscribed as a UNESCO World Heritage Site in 1987 due to its modernist architecture and uniquely artistic urban planning. It was named \"City of Design\" by UNESCO in October 2017 and has been part of the Creative Cities Network since then.\nIt is notable for its white-colored, modern architecture, designed by Oscar Niemeyer. All three branches of Brazil's federal government are located in the city: executive, legislative and judiciary. Brasília also hosts 124 foreign embassies. The city's international airport connects it to all other major Brazilian cities and some international destinations, and it is the third-busiest airport in Brazil. It was one of the main host cities of the 2014 FIFA World Cup and hosted some of the football matches during the 2016 Summer Olympics; it also hosted the 2013 FIFA Confederations Cup.\nLaid out in the shape of an airplane, its \"fuselage\" is the Monumental Axis, a pair of wide avenues flanking a large park. In the \"cockpit\" is Praça dos Três Poderes, named for the 3 branches of government surrounding it. Brasília has a unique legal status, as it is an administrative region rather than a municipality like other cities in Brazil. The name \"Brasília\" is often used as a synonym for the Federal District as a whole, which is divided into 35 administrative regions, one of which (Plano Piloto) includes the area of the originally planned city and its federal government buildings. The entire Federal District is considered by IBGE to make up Brasília's city area, and the local government considers the entirety of the district plus 12 neighboring municipalities in the state of Goiás to be its metropolitan area.\n\n\n== Etymology ==\nThe term Brasília comes from the Latin translation of Brazil, which was suggested as a name for the country's capital in 1821 by José Bonifácio de Andrada e Silva.\n\n\n== History ==\n\n\n=== Background ===\n\nBrazil's first capital was Salvador; in 1763 Rio de Janeiro became Brazil's capital and remained so until 1960. During this period, resources tended to be centered in Brazil's southeastern region, and most of the country's population was concentrated near its Atlantic coast. Brasilia's geographically central location fostered a more regionally neutral federal capital. An article of the country's first republican constitution, dated 1891, states that the capital should be moved from Rio de Janeiro to a place close to the country's center.\nThe idea of relocating Brazil's capital city was conceived in 1827 by José Bonifácio, an advisor to Emperor Pedro I. He presented a plan to the General Assembly of Brazil for a new city called Brasília, with the idea of moving the capital westward from the heavily populated southeastern corridor. The bill was not enacted because Pedro I dissolved the Assembly.\nAccording to a legend, Italian saint Don Bosco in 1883 had a dream in which he described a futuristic city that roughly fitted Brasília's location. In Brasília today, many references to Bosco, who founded the Salesian order, are found throughout the city and one church parish in the city bears his name.\n\n\n=== Costa plan ===\n\nJuscelino Kubitschek was elected President of Brazil in 1955. Upon taking office in January 1956, in fulfilment of his campaign pledge, he initiated the planning and construction of the new capital. The following year an international jury selected Lúcio Costa's plan to guide the construction of Brazil's new capital, Brasília. Costa was a student of the famous modernist architect Le Corbusier, and some of modernism's architecture features can be found in his plan. Costa's plan was not as detailed as some of the plans presented by other architects and city planners. It did not include land use schedules, models, population charts or mechanical drawings; however, it was chosen by five out of six jurors because it had the features required to align the growth of a capital city. Even though the initial plan was transformed over time, it oriented much of the construction and most of its features survived.\nBrasília's accession as the new capital and its designation for the development of an extensive interior region inspired the symbolism of the plan. Costa used a cross-axial design indicating the possession and conquest of this new place with a cross, often likened to a dragonfly, an airplane or a bird. Costa's plan included two principal components, the Monumental Axis (east to west) and the Residential Axis (north to south). The Monumental Axis was assigned political and administrative activities, and is considered the body of the city with the style and simplicity of its buildings, oversized scales, and broad vistas and heights, producing the idea of Monumentality. This axis includes the various ministries, national congress, presidential palace, supreme court building and the television and radio tower. The Residential Axis was intended to contain areas with intimate character and is considered the most important achievement of the plan; it was designed for housing and associated functions such as local commerce, schooling, recreation and churches, constituted of 96 superblocks limited to six-story buildings and 12 additional superblocks limited to three-story buildings; Costa's intention with superblocks was to have small self-contained and self-sufficient neighborhoods and uniform buildings with apartments of two or three different categories, where he envisioned the integration of upper and middle classes sharing the same residential area.\nThe urban design of the communal apartment blocks was based on Le Corbusier's Ville Radieuse of 1935, and the superblocks on the North American Radburn layout from 1929. Visually, the blocks were intended to appear absorbed by the landscape because they were isolated by a belt of tall trees and lower vegetation. Costa attempted to introduce a Brazil that was more equitable, he also designed housing for the working classes that was separated from the upper- and middle-class housing and was visually different, with the intention of avoiding slums (favelas) in the urban periphery. The superquadra has been accused of being a space where individuals are oppressed and alienated to a form of spatial segregation.\nOne of the main objectives of the plan was to allow the free flow of automobile traffic, the plan included lanes of traffic in a north–south direction (seven for each direction) for the Monumental Axis and three arterials (the W3, the Eixo and the L2) for the residential Axis; the cul-de-sac access roads of the superblocks were planned to be the end of the main flow of traffic. And the reason behind the heavy emphasis on automobile traffic is the architect's desire to establish the concept of modernity in every level.\n\nThough automobiles were invented prior to the 20th century, mass production of vehicles in the early 20th made them widely available; thus, they became a symbol of modernity. The two small axes around the Monumental axis provide loops and exits for cars to enter small roads. Some argue that his emphasis of the plan on automobiles caused the lengthening of distances between centers and it attended only the necessities of a small segment of the population who owned cars. But one can not ignore the bus transportation system in the city. The buses routes inside the city operate heavily on W3 and L2. Almost anywhere, including satellite cities, can be reached just by taking the bus and most of the Plano Piloto can be reached without transferring to other buses.\nLater, as the population of the city increased, the transportation system also played an important role in mediating the relationship between the Pilot plan and the satellite cities. Due to the larger influx of vehicles, traffic lights were introduced to the Monumental Axis, which violates the concept of modernity and advancement the architect first employed. Additionally, the metro system in Brasília was mainly built for inhabitants of satellite cities. Though this growth has made Brasília no longer a pure utopia with incomparable modernity, the later development of traffic management, bus routes to satellite cities, and the metro system all serve as a remedy to the dystopia, enabling the citizens to enjoy the kind of modernity that was not carefully planned.\nAt the intersection of the Monumental and Residential Axis Costa planned the city center with the transportation center (Rodoviaria), the banking sector and the hotel sector, near to the city center, he proposed an amusement center with theaters, cinemas and restaurants. Costa's Plan is seen as a plan with a sectoral tendency, segregating all the banks, the office buildings, and the amusement center.\nOne of the main features of Costa's plan was that he presented a new city with its future shape and patterns evident from the beginning. This meant that the original plan included paving streets that were not immediately put into use; the advantage of this was that the original plan is hard to undo because he provided for an entire street network, but on the other hand, is difficult to adapt and mold to other circumstances in the future. In addition, there has been controversy with the monumental aspect of Lúcio Costa's Plan, because it appeared to some as 19th century city planning, not modern 20th century in urbanism.\nAn interesting analysis can be made of Brasília within the context of Cold War politics and the association of Lúcio Costa's plan to the symbolism of aviation. From an architectural perspective, the airplane-shaped plan was certainly an homage to Le Corbusier and his enchantment with the aircraft as an architectural masterpiece. However, Brasília was constructed soon after the end of World War II. Despite Brazil's minor participation in the conflict, the airplane shape of the city was key in envisioning the country as part of the newly globalized world, together with the victorious Allies. Furthermore, Brasília is a unique example of modernism both as a guideline for architectural design but also as a principle for organizing society. Modernism in Brasília is explored in James Holston's book, The Modernist City.\n\n\n=== Construction ===\nJuscelino Kubitschek, president of Brazil from 1956 to 1961, ordered Brasília's construction, fulfilling the promise of the Constitution and his own political campaign promise. Building Brasília was part of Juscelino's \"fifty years of prosperity in five\" plan. Already in 1892, the astronomer Louis Cruls, in the service of the Brazilian government, had investigated the site for the future capital. Lúcio Costa won a contest and was the main urban planner in 1957, with 5550 people competing. Oscar Niemeyer was the chief architect of most public buildings, Joaquim Cardozo was the structural engineer, and Roberto Burle Marx was the landscape designer. Brasília was built in 41 months, from 1956 to 21 April 1960, when it was officially inaugurated.\n\n\n== Geography ==\n\nThe city sits at an elevation of 1,000 metres (3,300 ft) and more, high on the Brazilian Highlands in the country's center-western region. Paranoá Lake, a large artificial lake, was built to increase the amount of water available and to maintain the region's humidity. It has a marina, and hosts wakeboarders and windsurfers. Diving can also be practiced and one of the main attractions is Vila Amaury, an old village submerged in the lake. This is where the first construction workers of Brasília used to live.\n\n\n=== Climate ===\nBrasília has a tropical savanna climate (Aw, according to the Köppen climate classification), milder due to the elevation and with two distinct seasons: the rainy season, from October to April, and the dry season, from May to September. The average temperature is 21.4 °C (70.5 °F). September, at the end of the dry season, has the highest average maximum temperature, 29.1 °C (84.4 °F), and July has major and minor lower maximum average temperature, of 25.6 °C (78.1 °F) and 13.9 °C (57.0 °F), respectively. Average temperatures from September through March are a consistent 22 °C (72 °F). With 253.1 mm (10.0 in), November is the month with the highest rainfall of the year, while July is the lowest, with only 1.5 mm (0.1 in). During the dry season, the city can have very low relative humidity levels, often below 30%.\nAccording to the Brazilian National Institute of Meteorology (INMET), the record low temperature was 1.6 °C (34.9 °F) on 18 July 1975, and the record high was 36.4 °C (97.5 °F) on 18 October 2015 and 8 October 2020. The highest accumulated rainfall in 24 hours was 132.8 mm (5.2 in) on 15 November 1963.\n\n\n== Demographics ==\n\n\n=== Ethnic groups ===\n\nAccording to the 2022 IBGE Census, 2,817,381 people resided in Brasília and its metropolitan area, of whom 1,370,836 were Mixed (48.7%), 1,126,334 White (40%), 301,765 Black (10.7%), 12,810 Asian (0.5%), and 5,536 Amerindian (0.1%).\nIn 2010, Brasília was ranked the fourth-most populous city in Brazil after São Paulo, Rio de Janeiro, and Salvador. In 2010, the city had 474,871 opposite-sex couples and 1,241 same-sex couples. The population of Brasília was 52.2% female and 47.8% male.\nIn the 1960 census there were almost 140,000 residents in the new Federal district. By 1970 this figure had grown to 537,000. By 2010 the population of the Federal District had surpassed 2.5 million. The city of Brasília proper, the plano piloto was planned for about 500,000 inhabitants, a figure the plano piloto never surpassed, with a current population of only 214,529, but its metropolitan area within the Federal District has grown past this figure.\nFrom the beginning, the growth of Brasília was greater than original estimates. According to the original plans, Brasília would be a city for government authorities and staff. However, during its construction, Brazilians from all over the country migrated to the satellite cities of Brasília, seeking public and private employment.\nAt the close of the 20th century, Brasília was the largest city in the world which had not existed at the beginning of the century. Brasília has one of the highest population growth rates in Brazil, with annual growth of 2.82%, mostly due to internal migration.\nBrasília's inhabitants include a foreign population of mostly embassy workers as well as large numbers of Brazilian internal migrants. Today, the city has important communities of immigrants and refugees. The city's Human Development Index was 0.936 in 2000 (developed level), and the city's literacy rate was around 95.65%.\n\n\n=== Religion ===\n\nChristianity is by far the most prevalent religion in Brasília, with Roman Catholicism being the largest denomination.\n\nSource: IBGE 2010. \n\n\n== Government ==\n\nBrasília does not have a mayor or councillors, because article 32 of the Constitution of Brazil expressly prohibits the Federal District being divided into municipalities.\nThe Federal District is a legal entity of internal public law, which is part of the political-administrative structure of Brazil of a sui generis nature, because it is neither a state nor a municipality, but rather a special entity that incorporates the legislative powers reserved to the states and municipalities, as provided in Article 32, § 1º of the Constitution, which gives it a hybrid nature, both state and municipal.\nThe executive power of the Federal District was represented by the mayor of the Federal District until 1969, when the position was transformed into governor of the Federal District.\nThe legislative power of the Federal District is represented by the Legislative Chamber of the Federal District, whose nomenclature includes a mixture of legislative assembly (legislative power of the other units of the federation) and of municipal chamber (legislative of the municipalities). The Legislative Chamber is made up of 24 district deputies.\n\nThe judicial power which serves the Federal District also serves federal territories as it is constituted, but Brazil does not have any territories. Therefore, the Court of Justice of the Federal District and of the Territories only serves the Federal District.\nPart of the budget of the Federal District Government comes from the Constitutional Fund of the Federal District. In 2012, the fund totaled 9.6 billion reais. By 2015, the forecast is 12.4 billion reais, of which more than half (6.4 billion) is spent on public security spending.\n\n\n=== International relations ===\n\nTwin towns and sister cities\nBrasília is twinned with:\n\nOf these, Abuja and Washington, D.C. were also cities specifically planned as the seat of government of their respective countries.\n\nBrasília Declarations\nBrasília is associated with several significant declarations in the international political and social field, including:\n\nThe Brasília Declaration of the IBSA Dialogue Forum (2003), signed by the foreign ministers of India, Brazil and South Africa (IBSA) regarding representation at the United Nations Security Council\nBrasília Declaration on the Protection of Refugees and Stateless Persons in the Americas (2010)\nBrasília Declaration on Child Labour (2013), issued by the Third Global Conference on Child Labour – hosted in Brasília by the Brazilian Government\nBrasília Declaration of Judges on Water Justice (2018), adopted in 2018 during the Conference of Judges and Prosecutors on Water Justice at the 8th World Water Forum, described as \"a landmark in [the] development of water justice jurisprudence\"\nThe 15th Conference of Defense Ministers of the Americas, meeting in Brasília in 2022, issued a Declaration condemning Russia's invasion of Ukraine.\n\n\n== Economy ==\n\nThe major roles of construction and of services (government, communications, banking and finance, food production, entertainment, and legal services) in Brasília's economy reflect the city's status as a governmental rather than an industrial center. Industries connected with construction, food processing, and furnishings are important, as are those associated with publishing, printing, and computer software. The gross domestic product (GDP) is divided in Public Administration 54.8%, Services 28.7%, Industry 10.2%, Commerce 6.1%, Agrobusiness 0.2%.\nBesides being the political center, Brasília is an important economic center. In 2018, it has the third highest GDP of cities in Brazil, R$254 billion reais, representing 3.6% of the total Brazilian GDP. Most economic activity in the federal capital results from its administrative function. Its industrial planning is studied carefully by the Government of the Federal District. Being a city registered by UNESCO, the government in Brasília has opted to encourage the development of non-polluting industries such as software, film, video, and gemology among others, with emphasis on environmental preservation and maintaining ecological balance, preserving the city property.\nAccording to Mercer's city rankings of cost of living for expatriate employees, Brasília ranks 45th among the most expensive cities in the world in 2012, up from the 70th position in 2010, ranking behind São Paulo (12th) and Rio de Janeiro (13th).\n\n\n=== Industries ===\nIndustries in the city include construction (Paulo Octavio, Via Construções, and Irmãos Gravia among others); food processing (Perdigão, Sadia); furniture making; recycling (Novo Rio, Rexam, Latasa and others); pharmaceuticals (União Química); and graphic industries. The main agricultural products produced in the city are coffee, guavas, strawberries, oranges, lemons, papayas, soybeans, and mangoes. It has over 110,000 cows and it exports wood products worldwide.\nThe Federal District, where Brasília is located, has a GDP of R$133,4 billion (about US$64.1 billion), about the same as Belarus according to The Economist. Its share of the total Brazilian GDP is about 3.8%. The Federal District has the largest GDP per capita income of Brazil US$25,062, slightly higher than Belarus.\nThe city's planned design included specific areas for almost everything, including accommodation, Hotels Sectors North and South. New hotel facilities are being developed elsewhere, such as the hotels and tourism Sector North, located on the shores of Lake Paranoá.\n\n\n== Culture ==\n\nAs a venue for political events, music performances and movie festivals, Brasília is a cosmopolitan city, with around 124 embassies, a wide range of restaurants and a complete infrastructure ready to host any kind of event. Not surprisingly, the city stands out as an important business/tourism destination, which is an important part of the local economy, with dozens of hotels spread around the federal capital. Traditional parties take place throughout the year.\nIn June, large festivals known as \"festas juninas\" are held celebrating Catholic saints such as Saint Anthony of Padua, Saint John the Baptist, and Saint Peter. On 7 September, the traditional Independence Day parade is held on the Ministries Esplanade. Throughout the year, local, national, and international events are held throughout the city. Christmas is widely celebrated, and New Year's Eve usually hosts major events celebrated in the city.\nThe city also hosts a varied assortment of art works from artists like Bruno Giorgi, Alfredo Ceschiatti, Athos Bulcão, Marianne Peretti, Alfredo Volpi, Di Cavalcanti, Dyllan Taxman, Victor Brecheret and Burle Marx, whose works have been integrated into the city's architecture, making it a unique landscape. The cuisine in the city is very diverse. Many of the best restaurants in the city can be found in the Asa Sul district.\nThe city is the birthplace of Brazilian rock and place of origin of bands like: Legião Urbana, Capital Inicial, Aborto Elétrico, Plebe Rude and Raimundos. Brasília has the Rock Basement Festival which brings new bands to the national scene. The festival is held in the parking of the Brasília National Stadium Mané Garrincha.\n\nSince 1965, the annual Brasília Festival of Brazilian Cinema is one of the most traditional cinema festivals in Brazil, being compared only to the Brazilian Cinema Festival of Gramado, in Rio Grande do Sul. The difference between both is that the festival in Brasília still preserves the tradition to only submit and reward Brazilian movies.\nThe International Dance Seminar in Brasília has brought top-notch dance to the Federal Capital since 1991. International teachers, shows with choreographers and guest groups and scholarships abroad are some of the hallmarks of the event. The Seminar is the central axis of the DANCE BRAZIL program and is promoted by the DF State Department of Culture in partnership with the Cultural Association Claudio Santoro.\nBrasília has also been the focus of modern-day literature. Published in 2008, The World In Grey: Dom Bosco's Prophecy, by author Ryan J. Lucero, tells an apocalyptical story based on the famous prophecy from the late 19th century by the Italian saint Don Bosco. According to Don Bosco's prophecy: \"Between parallels 15 and 20, around a lake which shall be formed; A great civilization will thrive, and that will be the Promised Land\". Brasília lies between the parallels 15° S and 20° S, where an artificial lake (Paranoá Lake) was formed. Don Bosco is Brasília's patron saint.\nAmerican Flagg!, the First Comics comic book series created by Howard Chaykin, portrays Brasília as a cosmopolitan world capital of culture and exotic romance. In the series, it is a top vacation and party destination. The 2015 Rede Globo series Felizes para Sempre? was set in Brasília.\n\n\n=== Architecture and urbanism ===\n\nAt the Square of Three Powers, Brazilian architect Oscar Niemeyer and Brazilian structural engineer Joaquim Cardozo made buildings in the style of modern Brazilian architecture. The Congress also occupies various other surrounding buildings, some connected by tunnels.\nThe National Congress building is located in the middle of the Eixo Monumental, the city's main avenue. In front lies a large lawn and reflecting pool. The building faces the Praça dos Três Poderes where the Palácio do Planalto and the Supreme Federal Court are located. The Brazilian landscape architect Roberto Burle Marx designed landmark modernist gardens for some of the principal buildings. In residential areas, buildings were built that were inspired in French modernist and bauhaus design.\nAlthough not fully accomplished, the \"Brasília utopia\" has produced a city of relatively high quality of life, in which the citizens live in forested areas with sporting and leisure structure (the superquadras) surrounded by small commercial areas, bookstores and cafés; the city is famous for its cuisine and efficiency of transit. Even these positive features have sparked controversy, expressed in the nickname \"ilha da fantasia\" (\"fantasy island\"), indicating the sharp contrast between the city and surrounding regions, marked by poverty and disorganization in the cities of the states of Goiás and Minas Gerais, around Brasília.\nCritics of Brasilia's grand scale have characterized it as a modernist bauhaus platonic fantasy about the future:\n\nNothing dates faster than people's fantasies about the future. This is what you get when perfectly decent, intelligent, and talented men start thinking in terms of space rather than place; and single rather than multiple meanings. It's what you get when you design for political aspirations rather than real human needs. You get miles of jerry-built platonic nowhere infested with Volkswagens. This, one may fervently hope, is the last experiment of its kind. The utopian buck stops here.\n\n\n==== Notable structures ====\nThe Cathedral of Brasília in the capital of the Federative Republic of Brazil, is an expression of the atheist architect Oscar Niemeyer and the structural engineer Joaquim Cardozo. This concrete-framed hyperboloid structure, seems with its glass roof reaching up, open, to the heavens.\nThe cathedral's structure was finished on 31 May 1970, and only the 70 m (229.66 ft) diameter of the circular area were visible. Niemeyer's and Cardozo's project of Cathedral of Brasília is based in the hyperboloid of revolution which sections are asymmetric. The hyperboloid structure itself is a result of 16 identical assembled concrete columns. There is controversy as to what these columns, having hyperbolic section and weighing 90 t, represent, some say they are two hands moving upwards to heaven, others associate it to the chalice Jesus used in the last supper and some claim it represent his crown of thorns. The cathedral was dedicated on 31 May 1970.\nAt the end of the Eixo Monumental (\"Monumental Axis\") lies the Esplanada dos Ministérios (\"Ministries Esplanade\"), an open area in downtown Brasília. The rectangular lawn is surrounded by two eight-lane avenues where many government buildings, monuments and memorials are located. On Sundays and holidays, the Eixo Monumental is closed to cars so that locals may use it as a place to walk, bike, and have picnics under the trees.\nPraça dos Três Poderes (Portuguese for Square of the Three Powers) is a plaza in Brasília. The name is derived from the encounter of the three federal branches around the plaza: the Executive, represented by the Palácio do Planalto (presidential office); the Legislative, represented by the National Congress (Congresso Nacional); and the Judiciary branch, represented by the Supreme Federal Court (Supremo Tribunal Federal). It is a tourist attraction in Brasília, designed by Lúcio Costa and Oscar Niemeyer as a place where the three branches would meet harmoniously.\n\nThe Palácio da Alvorada is the official residence of the president of Brazil. The palace was designed, along with the rest of the city of Brasília, by Oscar Niemeyer and inaugurated in 1958. One of the first structures built in the republic's new capital city, the \"Alvorada\" lies on a peninsula at the shore of Lake Paranoá.\n\nThe principles of simplicity and modernity that in the past characterized the great works of architecture motivated Niemeyer. The viewer has an impression of looking at a glass box, softly landing on the ground with the support of thin external columns. The building has an area of 7,000 m2 with three floors consisting of the basement, landing, and second floor.\nThe auditorium, kitchen, laundry, medical center, and administration offices are at basement level. The rooms used by the presidency for official receptions are on the landing. The second floor has four suites, two apartments, and various private rooms which make up the residential part of the palace. The building also has a library, a heated Olympic-sized swimming pool, a music room, two dining rooms and various meeting rooms. A chapel and heliport are in adjacent buildings.\nThe Palácio do Planalto is the official workplace of the president of Brazil. It is located at the Praça dos Três Poderes in Brasília. As the seat of government, the term \"Planalto\" is often used as a metonym for the executive branch of government. The main working office of the President of the Republic is in the Palácio do Planalto.\nThe President and his or her family do not live in it, rather in the official residence, the Palácio da Alvorada. Besides the President, senior advisors also have offices in the \"Planalto\", including the Vice-President of Brazil and the Chief of Staff. The other Ministries are along the Esplanada dos Ministérios. The architect of the Palácio do Planalto was Oscar Niemeyer, creator of most of the important buildings in Brasília. The idea was to project an image of simplicity and modernity using fine lines and waves to compose the columns and exterior structures. The Palace is four stories high, and has an area of 36,000 m2. Four other adjacent buildings are also part of the complex.\n\n\n== Education ==\n\nThe education factor of Brasília's Human Development Index in 2020 reached the mark of 0.804 - a considerably high level, in line with the standards of the United Nations Development Programme (UNDP) - while the literacy rate of the population over the age of ten indicated by the last demographic census was 96.7%, above the national average (91%).\nThe city has seven international schools: the American School of Brasília, the Brasília International School, the Escola das Nações, the Swiss International School, the Lycée Français François Mitterrand, the Maple Bear Canadian School, and the British School of Brasília. Brasília has two universities, three university centers, and many private colleges.\nThe main tertiary educational institutions are: Universidade de Brasília – University of Brasília (UnB) (public); Universidade Católica de Brasília – Catholic University of Brasília; Centro Universitário de Brasília (UniCEUB); Centro Universitário Euroamaricano (Unieuro); Centro Universitário do Distrito Federal; Universidade Paulista; and Instituto de Educação Superior de Brasília.\nThere is an extreme concentration of higher education institutions in the Plano Piloto. In 2006, a new campus of the University of Brasilia was set up in Planaltina. There are also UnB campuses in the administrative regions of Ceilândia and Gama. The number of libraries is not proportional to the size of the population in the central area. The main public libraries in the Federal District are located in the city center, such as the University of Brasilia Library, the House and Senate Library, the Brasilia Demonstration Library and the Leonel de Moura Brizola National Library, also known as the Brasilia National Library, which opened in 2006.\n\n\n== Transportation ==\nThe average commute time on public transit in Brasília, for example to and from work, on a weekday is 96 min. 31% of public transit riders, ride for more than 2 hours every day. The average amount of time people wait at a stop or station for public transit is 28 min, while 61% of riders wait for over 20 minutes on average every day. The average distance people usually ride in a single trip with public transit is 15.1 km (9.4 mi), while 50% travel for over 12 km (7.5 mi) in a single direction.\n\n\n=== Airport ===\n\nBrasília–Presidente Juscelino Kubitschek International Airport serves the metropolitan area with major domestic and international flights. It is the third busiest Brazilian airport based on passengers and aircraft movements. Because of its strategic location it is a civil aviation hub for the rest of the country. This results in a large number of takeoffs and landings and it is not unusual for flights to be delayed in a holding pattern before landing. Following the airport's master plan, Infraero built a second runway, which was finished in 2006. In 2007, the airport handled 11,119,872 passengers. The main building's third floor, with 12 thousand square meters, has a panoramic deck, a food court, shops, four movie theaters with total capacity of 500 people, and space for exhibitions. Brasília Airport has 136 vendor spaces. The airport is located about 11 km (6.8 mi) from the central area of Brasília, outside the metro system. The area outside the airport's main gate is lined with taxis as well as several bus line services that connect the airport to Brasília's central district. The parking lot accommodates 1,200 cars.\nThe airport is serviced by domestic and regional airlines (TAM, GOL, Azul, WebJET, Trip and Avianca), in addition to a number of international carriers. In 2012, Brasília's International Airport was won by the InfraAmerica consortium, formed by the Brazilian engineering company ENGEVIX and the Argentine Corporacion America holding company, with a 50% stake each. During the 25-year concession, the airport may be expanded to up to 40 million passengers a year.\nIn 2014 the airport received 15 new boarding bridges, totaling 28 in all. This was the main requirement made by the federal government, which transferred the operation of the terminal to the Inframerica Group after an auction. The group invested R$750 million in the project. In the same year, the number of parking spaces doubled, reaching three thousand. The airport's entrance has a new rooftop cover and a new access road. Furthermore, a VIP room was created on Terminal 1's third floor. The investments increased the airport's capacity from approximately 15 million passengers per year to 21 million by 2014. Brasília Air Force Base - ALA1, one of their most important bases of the Brazilian Air Force, is located in Brasília.\n\n\n=== Road transport ===\n\nLike most Brazilian cities, Brasília has a good network of taxi companies. Taxis from the airport are available outside the terminal, but at times there can be quite a queue of people. Although the airport is not far from the downtown area, taxi prices do seem to be higher than in other Brazilian cities. Booking in advance can be advantageous, particularly if time is limited, and local companies should be able to assist airport transfer or transport requirements.\nThe Juscelino Kubitschek bridge, also known as the 'President JK Bridge' or the 'JK Bridge', crosses Lake Paranoá in Brasília. It is named after Juscelino Kubitschek, former president of Brazil. It was designed by architect Alexandre Chan and structural engineer Mário Vila Verde. Chan won the Gustav Lindenthal Medal for this project at the 2003 International Bridge Conference in Pittsburgh due to \"...outstanding achievement demonstrating harmony with the environment, aesthetic merit and successful community participation\". It consists of three 60 m (200 ft) tall asymmetrical steel arches that crisscross diagonally. With a length of 1,200 m (0.75 miles), it was completed in 2002 at a cost of US$56.8 million. The bridge has a pedestrian walkway and is accessible to bicyclists and skaters.\n\nThe main bus hub in Brasília is the Central Bus Station, located in the crossing of the Eixo Monumental and the Eixão, about 2 km (1.2 mi) from the Three Powers Plaza. The original plan was to have a bus station as near as possible to every corner of Brasília. Today, the bus station is the hub of urban buses only, some running within Brasília and others connecting Brasília to the satellite cities. In the original city plan, the interstate buses would also stop at the Central Station. Because of the growth of Brasília (and corresponding growth in the bus fleet), today the interstate buses leave from the older interstate station (called Rodoferroviária) located at the western end of the Eixo Monumental. The Central Bus Station also contains a main metro station. A new bus station was opened in July 2010. It is on Saída Sul (South Exit) near Parkshopping Mall with its metro station, and is also an inter-state bus station, used only to leave the Federal District.\n\n\n=== Metro ===\n\nThere is no passenger rail service in Brasília, but the Expresso Pequi rail line is planned to link Brasília and Goiânia (see below). A 22 km light rail line is also planned, estimated to cost between 1 billion reais (US$258 million) and 1.5 billion reais with capacity to transport around 200,000 passengers per day.\nThe Federal District Metro is Federal District's underground metro system. The system has 24 stations on two lines, the Orange and Green lines, along a total network of 43 km (27 mi), covering some of the Federal District. Both lines begin at the Central Station and run parallel until the Águas Claras Station. The Federal District Metro is not comprehensive so buses may provide better access to the center. The metro leaves the Rodoviária (bus station) and goes south, avoiding most of the political and tourist areas. The main purpose of the metro is to serve cities, such as Samambaia, Taguatinga and Ceilândia, as well as Guará and Águas Claras. The satellite cities served are more populated in total than the Plano Piloto itself (the census of 2000 indicated that Ceilândia had 344,039 inhabitants, Taguatinga had 243,575, and the Plano Piloto had approximately 400,000 inhabitants), and most residents of the satellite cities depend on public transportation.\nThe Expresso Pequi high-speed railway was planned between Brasília and Goiânia, the capital of the state of Goias, but it will probably be turned into a regional service linking the capital cities and cities in between, including Anápolis and Alexânia.\n\n\n== Sport ==\n\nThe main stadiums are Estadio Nacional Mané Garrincha (re-inaugurated on 18 May 2013), the Serejão Stadium (home for Brasiliense) and the Bezerrão Stadium (home for Gama).\nThere are a couple of professional clubs playing in Brasília, like Brasiliense, Gama, Brasília FC, and Real Brasília, but none are currently in the top two levels of Brazilian football. Clubs from Rio de Janeiro and São Paulo remain the most supported throughout the city.\nBrasília was one of the host cities of the 2014 FIFA World Cup and 2013 FIFA Confederations Cup. Brasília hosted the opening of the Confederations Cup and hosted 7 World Cup games. Brasília also hosted the football tournaments during the 2016 Summer Olympics held in Rio de Janeiro.\nBrasília is known as a departing point for the practice of unpowered air sports, sports that may be practiced with hang gliding or paragliding wings. Practitioners of such sports reveal that, because of the city's dry weather, the city offers strong thermal winds and great \"cloud-streets\", which is also the name for a maneuver quite appreciated by practitioners. In 2003, Brasília hosted the 14th Hang Gliding World Championship, one of the categories of free flying. In August 2005, the city hosted the second stage of the Brazilian Hang Gliding Championship.\nBrasília is the site of the Autódromo Internacional Nelson Piquet which hosted the Grande Prêmio Presidente Emílio Médici, a non-championship round of the 1974 Formula One Grand Prix season, which was won by Emerson Fittipaldi. An IndyCar race was cancelled at the last minute in 2015 due to financial concerns. The track, which has been closed since 2015, is being renovated for the end of 2023 after a deal was struck with Banco de Brasília and Terracap.\nThe city is also home to one of Brazil's top basketball clubs, the three-time NBB champion Uniceub BRB. The club hosts some of its games at the 16,000 all-seat Nilson Nelson Gymnasium. Brasília attempted to host the 2000 Summer Olympics, but withdrew its application. In tennis, Brasília is host to the Aberto da República, and formerly hosted the Aberto de Brasília.\n\n\n== See also ==\n\nList of purpose-built national capitals\nPurpose-built Brazilian state capitals\n\nAracaju\nBelo Horizonte\nBoa Vista\nPalmas\nTeresina\n\n\n== Explanatory notes ==\n\n\n== References ==\n\n\n== External links ==\n\nRegional Administration of Brasília website\nGovernment of the Federal District website\n Geographic data related to Brasília at OpenStreetMap\nExplore Brasília in the UNESCO collection on Google Arts & Culture\n\"The airport: About Inframerica\". Aeroporto de Brasíla. 2020. Archived from the original on 4 July 2019. Retrieved 20 April 2020."
    },
    {
      "id": 2447,
      "userId": 1,
      "content": "Anton Pavlovich Chekhov (; Russian: Антон Павлович Чехов, IPA: [ɐnˈton ˈpavləvʲɪtɕ ˈtɕexəf]; 29 January 1860 – 15 July 1904) was a Russian playwright and short-story writer, widely considered to be one of the greatest writers of all time. His career as a playwright produced four classics, and his best short stories are held in high esteem by writers and critics. Along with Henrik Ibsen and August Strindberg, Chekhov is often referred to as one of the three seminal figures in the birth of early modernism in the theatre. Chekhov was a physician by profession. \"Medicine is my lawful wife,\" he once said, \"and literature is my mistress.\"\nChekhov renounced the theatre after the reception of The Seagull in 1896, but the play was revived to acclaim in 1898 by Konstantin Stanislavski's Moscow Art Theatre, which subsequently also produced Chekhov's Uncle Vanya and premiered his last two plays, Three Sisters and The Cherry Orchard. These four works present a challenge to the acting ensemble as well as to audiences, because in place of conventional action Chekhov offers a \"theatre of mood\" and a \"submerged life in the text.\" The plays that Chekhov wrote were not complex, but easy to follow, and created a somewhat haunting atmosphere for the audience.\nChekhov began writing stories to earn money, but as his artistic ambition grew, he made formal innovations that influenced the evolution of the modern short story. He made no apologies for the difficulties this posed to readers, insisting that the role of an artist was to ask questions, not to answer them.\n\n\n== Biography ==\n\n\n=== Childhood ===\nAnton Pavlovich Chekhov was born on the feast day of St. Anthony the Great (17 January Old Style) 29 January 1860 in Taganrog, a commercial port city on the Sea of Azov – on Politseyskaya (Police) street, later renamed Chekhova street – in southern Russia. He was the third of six surviving children; he had two older brothers, Alexander and Nikolai, and three younger siblings, Ivan, Maria, and Mikhail. His father, Pavel Yegorovich Chekhov, the son of a former serf and his wife, was from the village Olkhovatka (Voronezh Governorate) and ran a grocery store. He was a director of the parish choir, a devout Orthodox Christian, and a physically abusive father.  Pavel Chekhov has been seen by some historians as the model for his son's many portraits of hypocrisy. Chekhov's mother, Yevgeniya (Morozova), was an excellent storyteller who entertained the children with tales of her travels all over Russia with her cloth-merchant father. \"Our talents we got from our father,\" Chekhov recalled, \"but our soul from our mother.\" \nYoung Chekhov attended the Greek School in Taganrog and The Taganrog Boys Gymnasium (since renamed the Chekhov Gymnasium). There he was held back for a year at fifteen for failing an examination in Ancient Greek. He sang at the Greek Orthodox monastery in Taganrog and in his father's choirs. In a letter of 1892, he used the word \"suffering\" to describe his childhood and recalled:\n\nWhen my brothers and I used to stand in the middle of the church and sing the trio \"May my prayer be exalted\", or \"The Archangel's Voice\", everyone looked at us with emotion and envied our parents, but we at that moment felt like little convicts.\nLater, in his adulthood, Chekhov criticized his brother Alexander's treatment of his wife and children by reminding him of their father Pavel's tyranny: \"Let me ask you to recall that it was despotism and lying that ruined your mother's youth. Despotism and lying so mutilated our childhood that it's sickening and frightening to think about it. Remember the horror and disgust we felt in those times when Father threw a tantrum at dinner over too much salt in the soup and called Mother a fool.\"\nIn 1876, Chekhov's father Pavel was declared bankrupt after overextending his finances building a new house, having been cheated by a contractor named Mironov. To avoid debtor's prison he fled to Moscow, where his two eldest sons, Alexander and Nikolai, were attending university. The family lived in poverty in Moscow. Chekhov's mother was physically and emotionally broken by the experience. \nChekhov was left behind to sell the family's possessions and finish his education. He remained in Taganrog for three more years, boarding with a man by the name of Selivanov who, like Lopakhin in The Cherry Orchard, had bailed out the family for the price of their house. Chekhov had to pay for his own education, which he managed by private tutoring, catching and selling goldfinches, and selling short sketches to the newspapers, among other jobs. He sent every ruble he could spare to his family in Moscow, along with humorous letters to cheer them up. \nAs a teenager Chekhov fell in love with the Taganrog Theatre. He attended the theatre on a regular basis and became enchanted and inspired by productions of vaudevilles, Italian operas and popular comedies.\nDuring that time, Chekhov read widely and analytically, including the works of Cervantes, Turgenev, Goncharov, and Schopenhauer, and wrote a full-length comic drama, Fatherless, which his brother Alexander dismissed as \"an inexcusable though innocent fabrication.\" Chekhov also experienced a series of love affairs, one with the wife of a teacher. In 1879, Chekhov completed his schooling in Taganrog and moved in with his family in Moscow, having gained admission to the medical school at I.M. Sechenov First Moscow State Medical University.\n\n\n=== Early writings ===\nChekhov then assumed responsibility for the whole family. To support them and to pay his tuition fees, he wrote daily short, humorous sketches and vignettes of contemporary Russian life, many under pseudonyms such as \"Antosha Chekhonte\" (Антоша Чехонте) and \"Man Without Spleen\" (Человек без селезенки). His prodigious output gradually earned him a reputation as a satirical chronicler of Russian street life, and by 1882 he was writing for Oskolki (Fragments), owned by Nikolai Leykin, one of the leading publishers of the time. Chekhov's tone at this stage was harsher than that familiar from his mature fiction.\n\nIn 1884, Chekhov qualified as a physician, which he considered his principal profession though he made little money from it and treated the poor free of charge.\nIn 1884 and 1885, Chekhov found himself coughing blood, and in 1886 the attacks worsened, but he would not admit his tuberculosis to his family or his friends. He confessed to Leykin, \"I am afraid to submit myself to be sounded by my colleagues.\" He continued writing for weekly periodicals, earning enough money to move the family into progressively better accommodations.\nEarly in 1886 he was invited to write for one of the most popular papers in St. Petersburg, Novoye Vremya (New Times), owned and edited by the millionaire magnate Alexey Suvorin, who paid a rate per line double Leykin's and allowed Chekhov three times the space. Suvorin was to become a lifelong friend, perhaps Chekhov's closest.\nBefore long, Chekhov was attracting literary as well as popular attention. The sixty-four-year-old Dmitry Grigorovich, a celebrated Russian writer of the day, wrote to Chekhov after reading his short story \"The Huntsman\" that \"You have real talent, a talent that places you in the front rank among writers in the new generation.\" He went on to advise Chekhov to slow down, write less, and concentrate on literary quality.\nChekhov replied that the letter had struck him \"like a thunderbolt\" and confessed, \"I have written my stories the way reporters write up their notes about fires—mechanically, half-consciously, caring nothing about either the reader or myself.\" The admission may have done Chekhov a disservice, since early manuscripts reveal that he often wrote with extreme care, continually revising. Grigorovich's advice nevertheless inspired a more serious, artistic ambition in the twenty-six-year-old. In 1888, with a little string-pulling by Grigorovich, the short story collection At Dusk (V Sumerkakh) won Chekhov the coveted Pushkin Prize \"for the best literary production distinguished by high artistic worth.\"\n\n\n=== Turning points ===\n\nIn 1887, exhausted from overwork and ill health, Chekhov took a trip to Ukraine, which reawakened him to the beauty of the steppe. On his return, he began the novella-length short story \"The Steppe\", which he called \"something rather odd and much too original\", and which was eventually published in Severny Vestnik (The Northern Herald). In a narrative that drifts with the thought processes of the characters, Chekhov evokes a chaise journey across the steppe through the eyes of a young boy sent to live away from home, and his companions, a priest and a merchant. \"The Steppe\" has been called a \"dictionary of Chekhov's poetics\", and it represented a significant advance for Chekhov, exhibiting much of the quality of his mature fiction and winning him publication in a literary journal rather than a newspaper.\nIn autumn 1887, a theatre manager named Korsh commissioned Chekhov to write a play, the result being Ivanov, written in a fortnight and produced that November. Though Chekhov found the experience \"sickening\" and painted a comic portrait of the chaotic production in a letter to his brother Alexander, the play was a hit and was praised, to Chekhov's bemusement, as a work of originality. \nAlthough Chekhov did not fully realise it at the time, Chekhov's plays, such as The Seagull (written in 1895), Uncle Vanya (written in 1897), The Three Sisters (written in 1900), and The Cherry Orchard (written in 1903) served as a revolutionary backbone to what is common sense to the medium of acting to this day: an effort to recreate and express the realism of how people truly act and speak with each other. This realistic manifestation of the human condition may engender in audiences reflection upon what it means to be human.\nThis philosophy of approaching the art of acting has stood not only steadfast, but as the cornerstone of acting for much of the 20th century to this day. Mikhail Chekhov considered Ivanov a key moment in his brother's intellectual development and literary career. From this period comes an observation of Chekhov's that has become known as Chekhov's gun, a dramatic principle that requires that every element in a narrative be necessary and irreplaceable, and that everything else be removed.\n\nRemove everything that has no relevance to the story. If you say in the first chapter that there is a rifle hanging on the wall, in the second or third chapter it absolutely must go off. If it's not going to be fired, it shouldn't be hanging there.\nThe death of Chekhov's brother Nikolai from tuberculosis in 1889 influenced A Dreary Story, finished that September, about a man who confronts the end of a life that he realises has been without purpose. Mikhail Chekhov recorded his brother's depression and restlessness after Nikolai's death.  Mikhail was researching prisons at that time as part of his law studies.  Anton Chekhov, in a search for purpose in his own life, himself soon became obsessed with the issue of prison reform.\n\n\n=== Sakhalin ===\n\nIn 1890, Chekhov undertook an arduous journey by train, horse-drawn carriage, and river steamer across Siberia to the Russian Far East and the katorga, or penal colony, on Sakhalin Island, north of Japan.  He spent three months there interviewing thousands of convicts and settlers for a census. The letters Chekhov wrote during the two-and-a-half-month journey to Sakhalin are considered to be among his best. His remarks to his sister about Tomsk were to become notorious.\n\nTomsk is a very dull town. To judge from the drunkards whose acquaintance I have made, and from the intellectual people who have come to the hotel to pay their respects to me, the inhabitants are very dull, too.\nChekhov witnessed much on Sakhalin that shocked and angered him, including floggings, embezzlement of supplies, and forced prostitution of women. He wrote,  \"There were times I felt that I saw before me the extreme limits of man's degradation.\" He was particularly moved by the plight of the children living in the penal colony with their parents. For example:\n\nOn the Amur steamer going to Sakhalin, there was a convict who had murdered his wife and wore fetters on his legs. His daughter, a little girl of six, was with him. I noticed wherever the convict moved the little girl scrambled after him, holding on to his fetters. At night the child slept with the convicts and soldiers all in a heap together.\nChekhov later concluded that charity was not the answer, but that the government had a duty to finance humane treatment of the convicts. His findings were published in 1893 and 1894 as Ostrov Sakhalin (The Island of Sakhalin), a work of social science, not literature. Chekhov found literary expression for the \"Hell of Sakhalin\" in his long short story \"The Murder\", the last section of which is set on Sakhalin, where the murderer Yakov loads coal in the night while longing for home. Chekhov's writing on Sakhalin, especially the traditions and habits of the Gilyak people, is the subject of a sustained meditation and analysis in Haruki Murakami's novel 1Q84. It is also the subject of a poem by the Nobel Prize winner Seamus Heaney, \"Chekhov on Sakhalin\" (collected in the volume Station Island). Rebecca Gould has compared Chekhov's book on Sakhalin to Katherine Mansfield's Urewera Notebook (1907). In 2013, the Wellcome Trust-funded play 'A Russian Doctor', performed by Andrew Dawson and researched by Professor Jonathan Cole, explored Chekhov's experiences on Sakhalin Island.\n\n\n=== Melikhovo ===\n\nMikhail Chekhov, a member of the household at Melikhovo, described the extent of his brother's medical commitments:\n\nFrom the first day that Chekhov moved to Melikhovo, the sick began flocking to him from twenty miles around. They came on foot or were brought in carts, and often he was fetched to patients at a distance. Sometimes from early in the morning peasant women and children were standing before his door waiting.\nChekhov's expenditure on drugs was considerable, but the greatest cost was making journeys of several hours to visit the sick, which reduced his time for writing. However, Chekhov's work as a doctor enriched his writing by bringing him into intimate contact with all sections of Russian society: for example, he witnessed at first hand the peasants' unhealthy and cramped living conditions, which he recalled in his short story \"Peasants\". Chekhov visited the upper classes as well, recording in his notebook: \"Aristocrats? The same ugly bodies and physical uncleanliness, the same toothless old age and disgusting death, as with market-women.\" In 1893/1894 he worked as a Zemstvo doctor in Zvenigorod, which has numerous sanatoriums and rest homes. A local hospital is named after him.\nIn 1894, Chekhov began writing his play The Seagull in a lodge he had built in the orchard at Melikhovo. In the two years since he had moved to the estate, he had refurbished the house, taken up agriculture and horticulture, tended the orchard and the pond, and planted many trees, which, according to Mikhail, he \"looked after ... as though they were his children. Like Colonel Vershinin in his Three Sisters, as he looked at them he dreamed of what they would be like in three or four hundred years.\"\nThe first night of The Seagull, at the Alexandrinsky Theatre in St. Petersburg on 17 October 1896, was a fiasco, as the play was booed by the audience, stinging Chekhov into renouncing the theatre. But the play so impressed the theatre director Vladimir Nemirovich-Danchenko that he convinced his colleague Konstantin Stanislavski to direct a new production for the innovative Moscow Art Theatre in 1898. Stanislavski's attention to psychological realism and ensemble playing coaxed the buried subtleties from the text, and restored Chekhov's interest in playwriting. The Art Theatre commissioned more plays from Chekhov and the following year staged Uncle Vanya, which Chekhov had completed in 1896. In the last decades of his life he became an atheist.\n\n\n=== Yalta ===\nIn March 1897, Chekhov suffered a major haemorrhage of the lungs while on a visit to Moscow. With great difficulty he was persuaded to enter a clinic, where doctors diagnosed tuberculosis on the upper part of his lungs and ordered a change in his manner of life.\n\nAfter his father's death in 1898, Chekhov bought a plot of land on the outskirts of Yalta and built a villa (The White Dacha), into which he moved with his mother and sister the following year. Though he planted trees and flowers, kept dogs and tame cranes, and received guests such as Leo Tolstoy and Maxim Gorky, Chekhov was always relieved to leave his \"hot Siberia\" for Moscow or travels abroad. He vowed to move to Taganrog as soon as a water supply was installed there. In Yalta he completed two more plays for the Art Theatre, composing with greater difficulty than in the days when he \"wrote serenely, the way I eat pancakes now\". He took a year each over Three Sisters and The Cherry Orchard.\nOn 25 May 1901, Chekhov married Olga Knipper quietly, owing to his horror of weddings. She was a former protégée and sometime lover of Vladimir Nemirovich-Danchenko whom he had first met at rehearsals for The Seagull. Up to that point, Chekhov, known as \"Russia's most elusive literary bachelor\", had preferred passing liaisons and visits to brothels over commitment. He had once written to Suvorin:\n\nBy all means I will be married if you wish it. But on these conditions: everything must be as it has been hitherto—that is, she must live in Moscow while I live in the country, and I will come and see her.... I promise to be an excellent husband, but give me a wife who, like the moon, won't appear in my sky every day.\n\nThe letter proved prophetic of Chekhov's marital arrangements with Olga: he lived largely at Yalta, she in Moscow, pursuing her acting career. In 1902, Olga suffered a miscarriage; and Donald Rayfield has offered evidence, based on the couple's letters, that conception occurred when Chekhov and Olga were apart, although other Russian scholars have rejected that claim. The literary legacy of this long-distance marriage is a correspondence that preserves gems of theatre history, including shared complaints about Stanislavski's directing methods and Chekhov's advice to Olga about performing in his plays.\nIn Yalta, Chekhov wrote one of his most famous stories, \"The Lady with the Dog\" (also translated from the Russian as \"Lady with Lapdog\"), which depicts what at first seems a casual liaison between a cynical married man and an unhappy married woman who meet while holidaying in Yalta. Neither expects anything lasting from the encounter.  Unexpectedly though, they gradually fall deeply in love and end up risking scandal and the security of their family lives.  The story masterfully captures their feelings for each other, the inner transformation undergone by the disillusioned male protagonist as a result of falling deeply in love, and their inability to resolve the matter by either letting go of their families or of each other.\n\n\n=== Death ===\nIn May 1903, Chekhov visited Moscow; the prominent lawyer Vasily Maklakov visited him almost every day. Maklakov signed Chekhov's will. By May 1904, Chekhov was terminally ill with tuberculosis. Mikhail Chekhov recalled that \"everyone who saw him secretly thought the end was not far off, but the nearer [he] was to the end, the less he seemed to realise it\". On 3 June, he set off with Olga for the German spa town of Badenweiler in the Black Forest in Germany, from where he wrote outwardly jovial letters to his sister Masha, describing the food and surroundings, and assuring her and his mother that he was getting better. In his last letter, he complained about the way German women dressed. Chekhov died on 15 July 1904 at the age of 44 after a long fight with tuberculosis, the same disease that killed his brother.\nChekhov's death has become one of \"the great set pieces of literary history\"—retold, embroidered, and fictionalized many times since, notably in the 1987 short story \"Errand\" by Raymond Carver. In 1908, Olga wrote this account of her husband's last moments:\n\nAnton sat up unusually straight and said loudly and clearly (although he knew almost no German): Ich sterbe ('I'm dying'). The doctor calmed him, took a syringe, gave him an injection of camphor, and ordered champagne. Anton took a full glass, examined it, smiled at me and said: 'It's a long time since I drank champagne.' He drained it and lay quietly on his left side, and I just had time to run to him and lean across the bed and call to him, but he had stopped breathing and was sleeping peacefully as a child ...\nChekhov's body was transported to Moscow in a refrigerated railway-car meant for oysters, a detail that offended Gorky. Some of the thousands of mourners followed the funeral procession of a General Keller by mistake, to the accompaniment of a military band. Chekhov was buried next to his father at the Novodevichy Cemetery.\n\n\n== Legacy ==\n\nA few months before he died, Chekhov told the writer Ivan Bunin that he thought people might go on reading his writings for seven years. \"Why seven?\", asked Bunin. \"Well, seven and a half\", Chekhov replied. \"That's not bad. I've got six years to live.\"\nChekhov's posthumous reputation greatly exceeded his expectations. The ovations for the play The Cherry Orchard in the year of his death served to demonstrate the Russian public's acclaim for the writer, which placed him second in literary celebrity only to Tolstoy, who outlived him by six years. Tolstoy was an early admirer of Chekhov's short stories and had a series that he deemed \"first quality\" and \"second quality\" bound into a book. In the first category were: Children, The Chorus Girl, A Play, Home, Misery, The Runaway, In Court, Vanka, Ladies, A Malefactor, The Boys, Darkness, Sleepy, The Helpmate, and The Darling; in the second: A Transgression, Sorrow, The Witch, Verochka, In a Strange Land, The Cook's Wedding, A Tedious Business, An Upheaval, Oh! The Public!, The Mask, A Woman's Luck, Nerves, The Wedding, A Defenceless Creature, and Peasant Wives.\nChekhov's work also found praise from several of Russia's most influential radical political thinkers. If anyone doubted the gloom and miserable poverty of Russia in the 1880s, the anarchist theorist Peter Kropotkin responded, \"read only Chekhov's novels!\" Raymond Tallis further recounts that Vladimir Lenin believed his reading of the short story Ward No. 6 \"made him a revolutionary\". Upon finishing the story, Lenin is said to have remarked: \"I absolutely had the feeling that I was shut up in Ward 6 myself!\"\nIn Chekhov's lifetime, British and Irish critics generally did not find his work pleasing; E. J. Dillon thought \"the effect on the reader of Chekhov's tales was repulsion at the gallery of human waste represented by his fickle, spineless, drifting people\" and R. E. C. Long said \"Chekhov's characters were repugnant, and that Chekhov revelled in stripping the last rags of dignity from the human soul\". After his death, Chekhov was reappraised. Constance Garnett's translations won him an English-language readership and the admiration of writers such as James Joyce, Virginia Woolf, and Katherine Mansfield, whose story \"The Child Who Was Tired\" is similar to Chekhov's \"Sleepy\". The Russian critic D. S. Mirsky, who lived in England, explained Chekhov's popularity in that country by his \"unusually complete rejection of what we may call the heroic values\". In Russia itself, Chekhov's drama fell out of fashion after the revolution, but it was later incorporated into the Soviet canon. The character of Lopakhin, for example, was reinvented as a hero of the new order, rising from a modest background so as eventually to possess the gentry's estates.\n\nDespite Chekhov's reputation as a playwright, William Boyd asserts that his short stories represent the greater achievement. Raymond Carver, who wrote the short story \"Errand\" about Chekhov's death, believed that Chekhov was the greatest of all short story writers:\n\nChekhov's stories are as wonderful (and necessary) now as when they first appeared. It is not only the immense number of stories he wrote—for few, if any, writers have ever done more—it is the awesome frequency with which he produced masterpieces, stories that shrive us as well as delight and move us, that lay bare our emotions in ways only true art can accomplish.\nAccording to literary critic Daniel S. Burt, Chekhov was one of the greatest and most influential writers of all time.\n\n\n=== Style ===\nOne of the first non-Russians to praise Chekhov's plays was George Bernard Shaw, who subtitled his Heartbreak House \"A Fantasia in the Russian Manner on English Themes\", and pointed out similarities between the predicament of the British landed class and that of their Russian counterparts as depicted by Chekhov: \"the same nice people, the same utter futility\".\nErnest Hemingway, another writer influenced by Chekhov, was more grudging: \"Chekhov wrote about six good stories. But he was an amateur writer.\" Comparing Chekhov to Tolstoy, Vladimir Nabokov wrote, \"I do love Chekhov dearly. I fail, however, to rationalize my feeling for him: I can easily do so in regard to the greater artist, Tolstoy, with the flash of this or that unforgettable passage […], but when I imagine Chekhov with the same detachment all I can make out is a medley of dreadful prosaisms, ready-made epithets, repetitions, doctors, unconvincing vamps, and so forth; yet it is his works which I would take on a trip to another planet.\" Nabokov called \"The Lady with the Dog\" \"one of the greatest stories ever written\" in its depiction of a problematic relationship, and described Chekhov as writing \"the way one person relates to another the most important things in his life, slowly and yet without a break, in a slightly subdued voice\".\nFor the writer William Boyd, Chekhov's historical accomplishment was to abandon what William Gerhardie called the \"event plot\" for something more \"blurred, interrupted, mauled or otherwise tampered with by life\".\nVirginia Woolf mused on the unique quality of a Chekhov story in The Common Reader (1925):\n\nBut is it the end, we ask? We have rather the feeling that we have overrun our signals; or it is as if a tune had stopped short without the expected chords to close it. These stories are inconclusive, we say, and proceed to frame a criticism based upon the assumption that stories ought to conclude in a way that we recognise. In so doing we raise the question of our own fitness as readers. Where the tune is familiar and the end emphatic—lovers united, villains discomfited, intrigues exposed—as it is in most Victorian fiction, we can scarcely go wrong, but where the tune is unfamiliar and the end a note of interrogation or merely the information that they went on talking, as it is in Tchekov, we need a very daring and alert sense of literature to make us hear the tune, and in particular those last notes which complete the harmony.\nMichael Goldman has said of the elusive quality of Chekhov's comedies: \"Having learned that Chekhov is comic ... Chekhov is comic in a very special, paradoxical way. His plays depend, as comedy does, on the vitality of the actors to make pleasurable what would otherwise be painfully awkward—inappropriate speeches, missed connections, faux pas, stumbles, childishness—but as part of a deeper pathos; the stumbles are not pratfalls but an energized, graceful dissolution of purpose.\"\n\n\n=== Influence on dramatic arts ===\nIn the United States, Chekhov's reputation began its rise slightly later, partly through the influence of Stanislavski's system of acting, with its notion of subtext: \"Chekhov often expressed his thought not in speeches\", wrote Stanislavski, \"but in pauses or between the lines or in replies consisting of a single word ... the characters often feel and think things not expressed in the lines they speak.\" The Group Theatre, in particular, developed the subtextual approach to drama, influencing generations of American playwrights, screenwriters, and actors, including Clifford Odets, Elia Kazan and, in particular, Lee Strasberg. In turn, Strasberg's Actors Studio and the \"Method\" acting approach influenced many actors, including Marlon Brando and Robert De Niro, though by then the Chekhov tradition may have been distorted by a preoccupation with realism. In 1981, the playwright Tennessee Williams adapted The Seagull as The Notebook of Trigorin. One of Anton's nephews, Michael Chekhov, would also contribute heavily to modern theatre, particularly through his unique acting methods which developed Stanislavski's ideas further.\nAlan Twigg, the chief editor and publisher of the Canadian book review magazine B.C. BookWorld wrote:\n\nOne can argue Anton Chekhov is the second-most popular writer on the planet. Only Shakespeare outranks Chekhov in terms of movie adaptations of their work, according to the movie database IMDb. ... We generally know less about Chekhov than we know about mysterious Shakespeare.\nChekhov has also influenced the work of Japanese playwrights including Shimizu Kunio, Yōji Sakate, and Ai Nagai. Critics have noted similarities in how Chekhov and Shimizu use a mixture of light humour as well as an intense depictions of longing. Sakate adapted several of Chekhov's plays and transformed them in the general style of nō. Nagai also adapted Chekhov's plays, including Three Sisters, and transformed his dramatic style into Nagai's style of satirical realism while emphasising the social issues depicted in the play.\nChekhov's works have been adapted for the screen, including Sidney Lumet's Sea Gull and Louis Malle's Vanya on 42nd Street. Laurence Olivier's final effort as a film director was a 1970 adaptation of Three Sisters in which he also played a supporting role. His work has also served as inspiration or been referenced in numerous films. In Andrei Tarkovsky's 1975 film The Mirror, characters discuss his short story \"Ward No. 6\". Woody Allen has been influenced by Chekhov and references to his works are present in many of his films including Love and Death (1975), Interiors (1978) and Hannah and Her Sisters (1986). Plays by Chekhov are also referenced in François Truffaut's 1980 drama film The Last Metro, which is set in a theatre. The Cherry Orchard has a role in the comedy film Henry's Crime (2011). A portion of a stage production of Three Sisters appears in the 2014 drama film Still Alice.  The 2022 Foreign Language Oscar winner, Drive My Car, is centered on a production of Uncle Vanya.\nSeveral of Chekhov's short stories were adapted as episodes of the 1986 Indian anthology television series Katha Sagar. Another Indian television series titled Chekhov Ki Duniya aired on DD National in the 1990s, adapting different works of Chekhov.\nNuri Bilge Ceylan's Palme d'Or winner Winter Sleep was adapted from the short story \"The Wife\" by Anton Chekhov.\n\n\n== Publications ==\n\n\n== See also ==\n\nChekhov's gun\nChekhov Library\nChekhov Monument in Rostov-on-Don\nAnn Dunnigan, English-language translator\nJean-Claude van Itallie, English-language translator\n\n\n== Explanatory notes ==\n\n\n== Citations ==\n\n\n== General and cited sources ==\n\n\n== External links ==\n\nBiographical\nPetri Liukkonen. \"Anton Chekhov\". Books and Writers.\nBiography at The Literature Network\n\"Chekhov's Legacy\" by Cornel West at NPR, 2004\nThe International competition of philological, culture and film studies works dedicated to Anton Chekhov's life and creative work (in Russian)\nDocumentary\n2010: Tschechow lieben (Tschechow and Women) – Director: Marina Rumjanzewa – Language: German\nWorks\nWorks by Anton Chekhov in eBook form at Standard Ebooks\nWorks by Anton Pavlovich Chekhov at Project Gutenberg. All Constance Garnett's translations of the short stories and letters are available, plus the edition of the Note-book translated by S. S. Koteliansky and Leonard Woolf – see the \"References\" section for print publication details of all of these. Site also has translations of all the plays.\nWorks by or about Anton Chekhov at the Internet Archive\nWorks by Anton Chekhov at LibriVox (public domain audiobooks) \n201 Stories by Anton Chekhov, translated by Constance Garnett presented in chronological order of Russian publication with annotations.\nАнтон Павлович Чехов. Указатель Texts of Chekhov's works in the original Russian, listed in chronological order, and also alphabetically by title. Retrieved June 2013. (in Russian)\nАнтон Павлович Чехов Texts of Chekhov's works in the original Russian. Retrieved 16 February 2007. (in Russian)\nWorks by Anton Chekhov at Open Library"
    },
    {
      "id": 7160,
      "userId": 1,
      "content": "The European Conference of Postal and Telecommunications Administrations (CEPT) was established on 26 June 1959 by nineteen European states in Montreux, Switzerland, as a coordinating body for European state telecommunications and postal organizations. The acronym comes from the French version of its name, Conférence européenne des administrations des postes et des télécommunications.\nCEPT was responsible for the creation of the European Telecommunications Standards Institute (ETSI) in 1988.\n\n\n== Organization ==\nCEPT is organised into three main components:\n\nElectronic Communications Committee (ECC) – responsible for radiocommunications and telecommunications matters and formed by the merger of ECTRA (European Committee for Telecommunications Regulatory Affairs) and ERC (European Radiocommunications Committee) in September 2001\nThe permanent secretariat of the ECC is the European Communications Office (ECO)\nEuropean Committee for Postal Regulation (CERP, after the French \"Comité européen des régulateurs postaux\") – responsible for postal matters\nThe committee for ITU Policy (Com-ITU) is responsible for organising the co-ordination of CEPT actions for the preparation for and during the course of the ITU activities meetings of the council, Plenipotentiary Conferences, World Telecommunication Development Conferences, World Telecommunication Standardisation Assemblies\nThe entity is based on the concept of a Postal, telegraph and telephone service entity.\n\n\n== Member countries ==\nAs of March 2022: 46 countries.\nAlbania, Andorra, Austria, Azerbaijan, Belgium, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Moldova, Monaco, Montenegro, Netherlands, North Macedonia, Norway, Poland, Portugal, Romania, San Marino, Serbia, Slovak Republic, Slovenia, Spain, Sweden, Switzerland, Turkey, Ukraine, United Kingdom, Vatican City.  The Russian Federation and Belarus memberships were suspended indefinitely on 17 March 2022.\n\n\n== See also ==\nEuropa postage stamp\nCEPT Recommendation T/CD 06-01 (standard for videotex)\nE-carrier (standard for multiplexed telephone circuits)\nInternational Telecommunication Union\nLPD433\nPMR446\nSRD860\nUniversal Postal Union\nWiMAX\nAfrican Telecommunications Union (ATU)\nAsia-Pacific Telecommunity (APT)\nCaribbean Postal Union (CPU)\nCaribbean Telecommunications Union (CTU)\nInter-American Telecommunication Commission (CITEL)\nPostal Union of the Americas, Spain and Portugal\nList of members of the Universal Postal Union\n\n\n== References ==\n\n\n== External links ==\nOfficial website \nECC website\nECO website\nCERP website\nCom-ITU website"
    },
    {
      "id": 2126,
      "userId": 1,
      "content": "Angela Maria \"Ani\" DiFranco (; born September 23, 1970) is an American-Canadian singer-songwriter. She has released more than 20 albums. DiFranco's music has been classified as folk rock and alternative rock, although it has additional influences from punk, funk, hip hop and jazz. She has released all her albums on her own record label, Righteous Babe.\nDiFranco supports many social and political movements by performing benefit concerts, appearing on benefit albums and speaking at rallies. Through the Righteous Babe Foundation, DiFranco has backed grassroots cultural and political organizations supporting causes including abortion rights and LGBT visibility. She counts American folk singer and songwriter Pete Seeger among her mentors.\nDiFranco released a memoir, No Walls and the Recurring Dream, on May 7, 2019, via Viking Books and made The New York Times Best Seller list.\nOn February 9, 2024, DiFranco made her Broadway debut in Hadestown as Persephone, reprising the role she played in the concept album of the same name.\n\n\n== Early life and education ==\nDiFranco was born in Buffalo, New York, on September 23, 1970, the daughter of Elizabeth (Ross) and Dante Americo DiFranco, who had met while attending the Massachusetts Institute of Technology. Her father was of Italian descent, and her mother was from Montreal. DiFranco started playing Beatles covers at local bars and busking with her guitar teacher, Michael Meldrum, at the age of nine. By 14 she was writing her own songs. She played them at bars and coffee houses throughout her teens. DiFranco graduated from the Buffalo Academy for Visual and Performing Arts high school at 16 and began attending classes at Buffalo State College. She was living by herself, having moved out of her mother's apartment after she became an emancipated minor when she was 15.\n\n\n== Career ==\nDiFranco started her own record company, Righteous Babe Records, in 1989 at age 19. She released her self-titled debut album in the winter of 1990, shortly after relocating to New York City. There, she took poetry classes at The New School, where she met poet Sekou Sundiata, who was to become a friend and mentor. She toured steadily for the next 15 years, pausing only to record albums. Appearances at Canadian folk festivals and increasingly larger venues in the U.S. reflected her increasing popularity on the North American folk and roots scene. Throughout the early and mid-1990s DiFranco toured solo and also as a duo with Canadian drummer Andy Stochansky.\nIn September 1995, DiFranco participated in a concert at the Rock and Roll Hall of Fame in Cleveland Ohio, inaugurating the opening of the Woody Guthrie Archives in New York City. She later released a CD on Righteous Babe of the concert Til We Outnumber Em featuring artists such as DiFranco, Billy Bragg, Ramblin' Jack Elliott, Arlo Guthrie, Indigo Girls, Dave Pirner, Tim Robbins, and Bruce Springsteen with 100 percent of proceeds going to the Woody Guthrie Foundation and Archives and the Rock and Roll Hall of Fame Museum educational department.\nIn 1996, bassist Sara Lee joined the touring group, whose live rapport is showcased on the 1997 album Living in Clip. DiFranco would later release Lee's solo album Make It Beautiful on Righteous Babe. In 1998, Stochansky left to pursue a solo career as a singer-songwriter. A new touring ensemble consisting of Jason Mercer on bass, Julie Wolf on keyboards, and Daren Hahn on drums, augmented at times by a horn section, accompanied DiFranco on tour between 1998 and 2002.\nThe 1990s were a period of heightened exposure for DiFranco, as she continued playing ever larger venues around the world and attracted international attention of the press, including cover stories in Spin, Ms., and Magnet, among others, as well as appearances on MTV and VH1. Her playfully ironic cover of the Bacharach/David song \"Wishin' and Hopin'\" appeared under the opening titles of the film My Best Friend's Wedding.\nShe guest starred on a 1998 episode of the Fox sitcom King of the Hill, as the voice of Peggy's feminist guitar teacher, Emily.\nBeginning in 1999, Righteous Babe Records began releasing albums by other artists including Sara Lee, Sekou Sundiata, Arto Lindsay, Bitch and Animal, That One Guy, Utah Phillips, Hamell on Trial, Andrew Bird, Kurt Swinghammer, Buddy Wakefield, Anaïs Mitchell and Nona Hendryx.\nOn September 11, 2001, DiFranco was in Manhattan and later penned the poem \"Self Evident\" about the experience. The poem was featured in the book It's a Free Country: Personal Freedom in America After September 11. The poem's title also became the name of DiFranco's first book of poetry released exclusively in Italy by Minimum Fax. It was later also featured in Verses, a book of her poetry published in the U.S. by Seven Stories press. DiFranco has written and performed many spoken-word pieces throughout her career and was showcased as a poet on the HBO series Def Poetry in 2005.\nSince her 2005 release Knuckle Down (co-produced by Joe Henry) DiFranco's touring band and recordings have featured bass player Todd Sickafoose and in turns other musicians such as Allison Miller, Andy Borger, Herlin Riley, and Terence Higgins on drums and Mike Dillon on percussion and vibes. On September 11, 2007, she released the first retrospective of her career, a two-disc compilation entitled Canon and simultaneously a retrospective collection of poetry book Verses. On September 30, 2008, she released Red Letter Year.\n\nIn 2009, DiFranco appeared at Pete Seeger's 90th birthday celebration at Madison Square Garden, debuting her revamped version of the 1930s labor anthem \"Which Side Are You On?\" in a duet with Bruce Cockburn and also duetting with Kris Kristofferson on the folk classic \"There's a Hole in the Bucket\". DiFranco released an album on January 17, 2012, ¿Which Side Are You On?. It includes collaborations with Pete Seeger, Ivan Neville, Cyril Neville, Skerik, Adam Levy, Righteous Babe recording artist Anaïs Mitchell, CC Adcock, and a host of New Orleans–based horn players known for their work in such outfits as Galactic, Bonerama, and Rebirth Brass Band. In 2014, she released her eighteenth album, Allergic to Water. In 2017, she released her nineteenth, Binary.\nOn May 7, 2019, DiFranco released a memoir, No Walls and the Recurring Dream, via Viking Books. It is described as a \"coming-of-age story\". In 2021, DiFranco released the album Revolutionary Love which was largely inspired by Valarie Kaur's book See No Stranger.\n\n\n== Personal life ==\nDiFranco came out as bisexual in her twenties, and has written songs about love and sex with women and men. She addressed the controversy about her sexuality in the song \"In or Out\" on the album Imperfectly (1992). However, in 2015 she told the blog GoPride.com that she was \"not so queer anymore, but definitely a woman-centered woman and just a human rights-centered artist.\" In a 2019 interview with Jezebel, she stated that she preferred the term \"queer\" because \"bisexual\" \"always sounded very medical, like something you do to a frog in 9th grade science or something\", and further added that \"the irony is I'm pretty fuckin' hetero, which is unfortunate for me because many of my deepest connections are with women. But, naw, I just like what's in boys' pants better.\" In 1998, she married her sound engineer Andrew Gilchrist in a Unitarian Universalist service in Canada. DiFranco and Gilchrist divorced in 2003.\nIn 1990, she wrote \"Lost Woman Song\", inspired by abortions she had at ages eighteen and twenty.\nDiFranco's father died in the summer of 2004. In July 2005, DiFranco developed tendinitis and took a nine-month hiatus from touring. In January 2007 DiFranco gave birth to her first child, a daughter, at her Buffalo home. She married the child's father, Mike Napolitano, also her regular producer, in 2009. In an interview on September 13, 2012, DiFranco mentioned that she was pregnant with her second child. In April 2013, she gave birth to her second child, a son.\nShe has resided in the Bywater, New Orleans, neighborhood since 2008.\nDiFranco signed the October 2023 Artists4Ceasefire open letter to Joe Biden calling for a ceasefire during the Israeli bombardment of Gaza.\nShe has described herself as an atheist. On the subject of religion, DiFranco has stated:\n\nWell, I'm not a religious person myself. I'm an atheist. I think religion serves a lot of different purposes in people's lives, and I can recognize the value of that, you know, the value of ceremony, the value of community, or even just having a forum to get together and talk about ideas, about morals – that's a cool concept. But then, of course, institutional religions are so problematic.\nDiFranco has spoken critically of cancel culture, saying it is \"just gonna get us nowhere\" and \"The human family can't divorce each other\". DiFranco herself has received criticism for planning a 2013 songwriting retreat at Nottoway, a former slave plantation. She cancelled the retreat three days after the news broke, writing on her website, \"I needed a wake-up call and you gave it to me.\" In a 2019 interview, she said of her choices at the time, \"I should have found the ultimate humility to put down my own hurt, and all of the misconceptions or mis-truths out there. You have to make yourself accountable. There's a greater pain that's bigger than me, and it's more important.\"\nShe wrote in her memoir that she \"[sympathized] with both sides\" regarding the controversial trans-exclusionary policies of the Michigan Womyn's Music Festival. In a 2019 interview, she elaborated on this statement, discussing her perception that cisgender women were being \"asked again ... to move over and make room for somebody else,\" and later expressed that she understood the difficulty \"for anybody outside of a very specific group to experience it the way that group does,\" saying that \"maybe [women's spaces] should be a little more [inclusive]\".\nDiFranco is the subject of the 2024 documentary film 1-800-On-Her-Own.\n\n\n== Critical reception ==\nDiFranco has been a critical success for much of her career, with a career album average of 55 on Metacritic. Living in Clip, DiFranco's 1998 double live album, is the only one to achieve gold record status to date. DiFranco was praised by The Buffalo News in 2006 as \"Buffalo's leading lady of rock music\".\nStarting in 2003, DiFranco was nominated four consecutive times for Best Recording Package at the Grammy Awards, winning in 2004 for Evolve.\n\n\n== Music ==\n\n\n=== Style ===\nDiFranco's guitar playing is often characterized by a signature staccato style, rapid fingerpicking and many alternate tunings. She delivers many of her lines in a speaking style notable for its rhythmic variation. Her lyrics, which often include alliteration, metaphor, word play and a more or less gentle irony, have also received praise for their sophistication.\n\nAlthough DiFranco's music has been classified as both folk rock and alternative rock, she has reached across genres since her earliest albums incorporating first punk, then funk, hiphop, and jazz influences.\nWhile primarily an acoustic guitarist she has used a variety of instruments and styles: brass instrumentation was prevalent in 1998's Little Plastic Castle; a simple walking bass in her 1997 cover of Hal David and Burt Bacharach's \"Wishin' and Hopin'\"; strings on the 1997 live album Living in Clip and 2004's Knuckle Down; and electronics and synthesizers in 1999's To the Teeth and 2006's Reprieve.\nDiFranco has stated that \"folk music is not an acoustic guitar – that's not where the heart of it is. I use the word 'folk' in reference to punk music and rap music. It's an attitude, it's an awareness of one's heritage, and it's a community. It's subcorporate music that gives voice to different communities and their struggle against authority.\"\n\n\n=== Musical collaborations, cover versions, and samples ===\nDiFranco has collaborated with a wide range of artists. In 1997, she appeared on Canadian songwriter Bruce Cockburn's Charity of Night album. In 1998, she produced fellow folksinger Dan Bern's album Fifty Eggs.\nShe developed a deep association with folksinger and social activist Utah Phillips throughout the mid-1990s, sharing her stage and her audience with the older musician until his death in 2008 and resulting in two collaborative albums: The Past Didn't Go Anywhere (1996) and Fellow Workers (1999, with liner notes by Howard Zinn). The Past is built around Phillips's storytelling, an important part of his art that had not previously been documented on recordings; on the album, DiFranco provides musical settings for his speaking voice. The followup, Fellow Workers, was recorded live in Daniel Lanois's Kingsway Studio in New Orleans and features Phillips fronting DiFranco's touring band for a collection of songs and stories.\nPrince recorded two songs with DiFranco in 1999, \"Providence\" on her To the Teeth album, and \"Eye Love U, But Eye Don't Trust U Anymore\" on Prince's Rave Un2 the Joy Fantastic album. Funk and soul jazz musician Maceo Parker and rapper Corey Parker have both appeared on DiFranco's albums and featured appearances by her on theirs. Parker and DiFranco toured together in 1999.\nShe has appeared on several compilations of the songs of Pete Seeger and frequented his Hudson Clearwater Revival Festival. In 2001, she appeared on Brazilian artist Lenine's album Falange Canibal. In 2002, her rendition of Greg Brown's \"The Poet Game\" appeared on Going Driftless: An Artist's Tribute to Greg Brown. Also in 2002 she recorded a duet with Jackie Chan of the Irving Gordon song \"Unforgettable\" for a record of unlikely collaborations, When Pigs Fly: Songs You Never Thought You'd Hear.\nIn 2005, she appeared on Dar Williams' record My Better Self, duetting on William's cover of Pink Floyd's \"Comfortably Numb\". She performed with Cyndi Lauper on \"Sisters of Avalon\" a track from Lauper's 2005 The Body Acoustic album. In 2006, she produced Hamell on Trial's album Songs for Parents Who Enjoy Drugs. In 2008, she appeared on Todd Sickafoose's album Tiny Resisters. In 2010, she co-produced a track with Margaret Cho called \"Captain Cameltoe\" for the comedian's Cho Dependant album. In 2011, she appeared on Rob Wasserman's album Note of Hope, an exploration of the writings of Woody Guthrie with musical accompaniment, though the track in which she appeared, \"Voice\", was actually recorded 13 years earlier. Also in 2011 she duetted with Greg Dulli on the Twilight Singers record Dynamite Steps.\nOther artists have covered and sampled DiFranco's work throughout the years. Her spoken word poem \"Self Evident\" was covered by Public Enemy founder Chuck D's group called Impossebulls. Alana Davis had some commercial success with DiFranco's song \"32 Flavors\". Samples from the track \"Coming Up\" were used by DJ Spooky in his album Live Without Dead Time, produced for AdBusters Magazine in 2003. In 2010, DiFranco played Persephone on Anaïs Mitchell's album Hadestown.\nDiFranco was approached by Zoe Boekbinder to work on their Prison Music Project, an album of collaborations between incarcerated and formerly incarcerated writers and musicians on the outside. DiFranco co-produced the project with Boekbinder and co-wrote and performed \"Nowhere but Barstow and Prison.\" The album Long Time Gone was released on Righteous Babe Records in 2020 after ten years in the making.\n\n\n=== Lyrical content ===\nAlthough much of DiFranco's material is autobiographical, it is often also strongly political. Many of her songs are concerned with contemporary social issues such as racism, sexism, sexual abuse, homophobia, reproductive rights, poverty, and war. In 2008, she donated a song to Aid Still Required's CD to assist with the restoration of the devastation done to Southeast Asia from the 2004 tsunami. The combination of personal and political is partially responsible for DiFranco's early popularity among politically active college students, particularly those of the left wing, some of whom set up fan pages on the web to document DiFranco's career as early as 1994. DiFranco's rapid rise in popularity in the mid-1990s was fueled mostly by personal contact and word of mouth rather than mainstream media.\n\n\n=== Label independence ===\nDiFranco cites her anti-corporate ethos for the main reason she decided to start her own label. This has allowed her a considerable degree of creative freedom over the years, including, for example, providing all instrumentals and vocals and recording the album herself at her home on an analog 8-track reel to reel, and handling much of the artwork and packaging design for her 2004 album Educated Guess. She has referenced this independence from major labels in song more than once, including \"The Million You Never Made\" (Not a Pretty Girl), which discusses the act of turning down a lucrative contract, \"The Next Big Thing\" (Not So Soft), which describes an imagined meeting with a label head-hunter who evaluates the singer based on her looks, and \"Napoleon\" (Dilate), which sympathizes sarcastically with an unnamed friend who did sign with a label.\nThe business grew organically starting in 1990 with the first cassette tape. Connections were made when women in colleges started duplicating and sharing tapes. Offers to play at colleges started coming in and her popularity grew largely by word of mouth and through women's groups or organizations. Zango and Goldenrod, two music distributors specializing in women's music, started carrying DiFranco's music. They sold music to independent music stores and women's book stores. In 1995, Righteous Babe Records signed with Koch International for DiFranco's release of Not a Pretty Girl. Her records could then be found in large and small record stores alike.\nDiFranco has occasionally joined with Prince in discussing publicly the problems associated with major record companies. Righteous Babe Records employs a number of people in her hometown of Buffalo. In a 1997 open letter to Ms. magazine she expressed displeasure that what she considers a way to ensure her own artistic freedom was seen by others solely in terms of its financial success.\n\n\n== Activism ==\nFrom the earliest days of her career, DiFranco has lent her voice and her name to a broad range of social movements, performing benefit concerts, appearing on benefit albums, speaking at rallies, and offering info table space to organizations at her concerts and the virtual equivalent on her website, among other methods and actions. In 1999, she created her own not-for-profit organization; as the Buffalo News has reported, \"Through the Righteous Babe Foundation, DiFranco has backed various grassroots cultural and political organizations, supporting causes ranging from abortion rights to gay visibility.\"\nDuring the first Gulf War, DiFranco participated in the anti-war movement. In early 1993 she played Pete Seeger's Clearwater Folk Festival for the first time. In 1998, she was a featured performer in the Dead Man Walking benefit concert series raising money for Sister Helen Prejean's \"Not in Our Name\" anti-death penalty organization. DiFranco's commitment to opposing the death penalty is longstanding; she has also been a long time supporter of the Southern Center for Human Rights.\nDuring the 2000 U.S. presidential election, she actively supported and voted for Green Party candidate Ralph Nader, though in an open letter she made clear that if she lived in a swing state, she would vote for Al Gore to prevent George W. Bush from being elected.\nIn 2004, DiFranco visited Burma in order to learn about the Burmese resistance movement and the country's fight for democracy. During her travels she met with then-detained resistance leader Aung San Suu Kyi. Her song \"In The Way\" was later featured on For the Lady, a benefit CD that donated all proceeds to the United States Campaign for Burma.\nDuring the 2004 presidential primaries, she supported liberal, anti-war Democrat Dennis Kucinich, who appeared on stage with her during several of her concerts. After the primary season ended, and John Kerry was the clear Democratic candidate, DiFranco launched a \"Vote Dammit!\" tour of swing states encouraging audience members to vote. In 2005, she lobbied Congress against the proliferation of nuclear power in general and the placement of nuclear waste dumps on Indian land in particular. In 2008, she again backed Kucinich in his bid for the presidency.\nIn 2002, Righteous Babe Records established the \"Aiding Buffalo's Children\" program in conjunction with members of the local community to raise funds for Buffalo's public school system. To kick off the program, DiFranco donated \"a day's pay\"—the performance fee from her concert that year at Shea's Performing Arts Center— to ABC and challenged her fans to do the same. Aiding Buffalo's Children has since been folded into the Community Foundation of Greater Buffalo, contributing to a variety of charitable funds.\nIn 2005, when Hurricane Katrina devastated DiFranco's newly adopted home town of New Orleans, she collected donations from fans around the world through The Righteous Babe Store website for the Katrina Piano Fund, helping musicians replace instruments lost in the hurricane, raising over $47,500 for the cause.\nIn 2010, after the Deepwater Horizon oil spill, she performed at the \"For Our Coast\" benefit concert joining Marianne Faithfull, C. C. Adcock and others at the Acadiana Center for the Arts Theater in Lafayette, raising money for Gulf Aid Acadiana, and the Gulf Aid show with Lenny Kravitz, Mos Def, and others at Mardi Gras World River City in New Orleans, both shows raising money to help protect the wetlands, clean up the coast and to assist the fishermen and their families affected by the spill.\nDiFranco sits on the board for The Roots of Music, founded by Rebirth Brass Band drummer Derrick Tabb. The organization provides free marching band instruction to children in the New Orleans area in addition to academic tutoring and mentoring.\nDiFranco joined about 500,000 people at the March for Women's Lives in DC in April 2004. As an honored guest she marched in the front row for the three-mile route, along with Margaret Cho, Janeane Garofalo, Whoopi Goldberg, Gloria Steinem and others. Later in the day, DiFranco played a few songs on the main stage in front of the Capitol, including \"Your Next Bold Move\".\nScot Fisher, formerly Righteous Babe label president and DiFranco's manager for many years, has been a longtime advocate of the preservation movement in Buffalo. In 1999, he and DiFranco purchased a decaying church on the verge of demolition in downtown Buffalo and began the lengthy process of restoring it. In 2006, the building opened its doors again, first briefly as \"The Church\" and then as \"Babeville,\" housing two concert venues, the record label's business office, and Hallwalls Contemporary Arts Center.\nDiFranco is a member of the Toronto-based charity Artists Against Racism for which she participated in a radio PSA.\nOn July 21, 2006, she received the Woman of Courage Award at the National Organization for Women (NOW) Conference and Young Feminist Summit in Albany, New York. DiFranco was one of the first musicians to receive the award, given each year to a woman who has set herself apart by her contributions to the feminist movement.\nIn 2009, DiFranco received the Woody Guthrie Award for being a voice of positive social change.\nIn October 2023, DiFranco signed an open letter to Joe Biden, President of the United States, of artists calling for a ceasefire of the Israeli bombardment of Gaza.\n\n\n== Awards and nominations ==\n\n\n== Discography ==\n\n\n=== Studio albums ===\nAni DiFranco (1990)\nNot So Soft (1991)\nImperfectly (1992)\nPuddle Dive (1993)\nOut of Range (1994)\nNot a Pretty Girl (1995)\nDilate (1996)\nLittle Plastic Castle (1998)\nUp Up Up Up Up Up (1999)\nTo the Teeth (1999)\nRevelling/Reckoning (2001)\nEvolve (2003)\nEducated Guess (2004)\nKnuckle Down (2005)\nReprieve (2006)\nRed Letter Year (2008)\n¿Which Side Are You On? (2012)\nAllergic to Water (2014)\nBinary (2017)\nRevolutionary Love (2021)\nUnprecedented Sh!t (2024)\n\n\n==== with Utah Phillips ====\nThe Past Didn't Go Anywhere (1996)\nFellow Workers (1999)\n\n\n=== Live albums ===\n1994 – An Acoustic Evening With\n1994 – Women in (E)motion (German Release)\n1997 – Living in Clip\n2002 – So Much Shouting, So Much Laughter\n2004 – Atlanta – 10.9.03 (Official Bootleg series #1)\n2004 – Sacramento – 10.25.03 (Official Bootleg series #1)\n2004 – Portland – 4.7.04 (Official Bootleg series #1)\n2005 – Boston – 11.16.03 (Official Bootleg series #1)\n2005 – Chicago – 1.17.04 (Official Bootleg series #1)\n2005 – Madison – 1.25.04 (Official Bootleg series #1)\n2005 – Rome – 11.15.04 (Official Bootleg series #1)\n2006 – Carnegie Hall – 4.6.02 (Official Bootleg series No. 1 – available in stores)\n2007 – Boston – 11.10.06 (Official Bootleg series #1)\n2008 – Hamburg – 10.18.07 (Official Bootleg series #1)\n2009 – Saratoga, CA – 9.18.06 (Official Bootleg series #1)\n2009 – Chicago – 9.22.07 (Official Bootleg series #1)\n2010 – Live at Bull Moose Music (Limited edition)\n2012 – Buffalo – April 22, 2012 (Official Bootleg series #2)\n2013 – London – October 29, 2008 (Official Bootleg series #2)\n2014 – Ridgefield, CT – November 18, 2009 (Official Bootleg series #2)\n2014 – Harrisburg, PA – January 23, 2008 (Official Bootleg series #2)\n2015 – New York, NY – March 30, 1995 (Official Bootleg series #2)\n2016 – Glenside, PA – November 11, 2012 (Official Bootleg series #2)\n2016 – Melbourne, FL – January 19, 2016 (Official Bootleg series #2)\n2018 – Charlottesville, VA 5.12.18 (Official Bootleg series #3)\n2019 – Woodstock, NY Jun 16, 2019 (Official Bootleg series #3)\n2020 – Keene, NH Nov 16, 2019 (Official Bootleg series #3)\n2021 – Revolutionary Love: Live at Big Blue\n\n\n=== EPs ===\n1996 – More Joy, Less Shame\n1999 – Little Plastic Remixes (limited distribution)\n2000 – Swing Set\n2016 – Play God\n\n\n=== Videos ===\n2002 – Render: Spanning Time with Ani DiFranco\n2004 – Trust\n2008 – Live at Babeville\n\n\n=== Compilations ===\n1993 – Like I Said: Songs 1990–91\n1995 – Live from Mountain Stage, Vol. 8 – \"Buildings & Bridges (live)\"\n1996 – Women's Work – \"Cradle and All (live)\"\n1996 – Women: Live from Mountain Stage – \"Egos Like Hairdos (live)\"\n1997 – Divine Divas: A World of Women's Voices – \"Amazing Grace\"\n1998 – Live at World Café Vol. 6 – \"Buildings & Bridges (live)\"\n1998 – Modern Day Storytellers – \"Buildings & Bridges\"\n1998 – Rare on Air Vol. 4 (KCRW) – \"Gravel (live)\"\n1998 – Where Have All the Flowers Gone: Songs of Pete Seeger – \"My Name is Lisa Kalvelage\"\n1998 – Women of Spirit – \"Done Wrong\"\n1999 – Respect: A Century of Women in Music – \"32 Flavors\"\n2000 – Badlands: A Tribute to Bruce Springsteen's Nebraska – \"Used Cars\"\n2000 – Best of Hard Rock Café Live – \"Little Plastic Castle (live)\"\n2000 – 'Til We Outnumber 'Em – Performed \"Do Re Mi\" solo and \"Ramblin' Round\" with Indigo Girls; Producer\n2001 – Live @ The World Café Vol. 10 – \"32 Flavors\"\n2001 – Best of Sessions at West 54th – \"32 Flavors\"\n2002 – Gascd – \"Your Next Bold Move\"\n2002 – Going Driftless: An Artist Tribute to Greg Brown – \"The Poet Game\"\n2002 – When Pigs Fly: Songs You Never Thought You'd Hear – \"Unforgettable\" w/ Jackie Chan\n2003 – Peace Not War – \"Self Evident\"\n2004 – Peace Not War Vol. 2 – \"Animal\"\n2004 – For the Lady – \"In the Way\"\n2005 – Bonnaroo Music Festival 2004 (CD & DVD) – \"Evolve (live)\"\n2006 – Music Is Hope – \"Napoleon (remix)\"\n2006 – Dead Man Walking: Music from and Inspired by the Motion Picture – \"Crime for Crime\", \"Fuel\", \"Up Up Up Up Up Up\"\n2007 – Canon\n2007 – Sowing the Seed: The 10th Anniversary Appleseed Recordings – \"Waist Deep in the Big Muddy\"\n2007 – Cool as Folk: Cambridge Folk Festival – \"Cradle and All (live)\"\n2009 – Singing Through the Hard Times: A Utah Phillips Celebration – \"The International\"\n2011 – Note of Hope: A Celebration of Woody Guthrie – \"Voice\"\n2011 – Every Mother Counts – \"Present/Infant\" (Remix)\n2012 – Occupy This Album – \"Which Side Are You On? (a capella)\"\n2019 – No Walls Mixtape\n2020 – Prison Music Project: Long Time Gone –  \"Nowhere but Barstow and Prison\"\n\n\n=== As producer ===\n1998 – Dan Bern – Fifty Eggs\n2010 – Margaret Cho – Cho Dependent – co-producer on \"Captain Cameltoe\"\n2017 – Peter Mulvey – Are You Listening?\n2020 – Prison Music Project: Long Time Gone\n\n\n=== Other contributions ===\n1989 – Demo tape (unreleased)\n2001 – John Gorka – The Company You Keep – backing vocals on \"Oh Abraham\"\n2006 – Jason Karaban – Doomed to Make Choices\n2006 – Twilight Singers – Powder Burns – Featured on \"Bonnie Brae,\" \"Candy Cane Crawl,\" and \"Powder Burns\"\n2008 – Dr. John – The City That Care Forgot – Contributed backing vocals to the title track.\n2009 – Jason Karaban – Sobriety Kills\n2010 – Anaïs Mitchell – Hadestown\n2010 – Preservation Hall Jazz Band – Preservation: An Album to Benefit Preservation Hall & The Preservation Hall Music Outreach Program – Featured on \"Freight Train\"\n2011 – Twilight Singers – Dynamite Steps – Featured on \"Blackbird and the Fox\"\n2016 – Ryan Harvey – Featured on \"Old Man Trump\"\n2019 – Rising Appalachia – Leylines – Featured on \"Speak Out\"\n2021 – Pieta Brown – Featured on \"We Are Not Machines\"\n\n\n== Poetry ==\n2004 – Self-evident: poesie e disegni\n2007 – Verses\n\n\n== References ==\n\n\n== External links ==\n\nOfficial website \nThe Righteous Babe homepage\nAni DiFranco at IMDb \nAni DiFranco discography at MusicBrainz \nAni DiFranco at Rolling Stone"
    }
  ],
  "savedWikis": [
    {
      "id": "1",
      "userId": 1,
      "wikiId": 1
    },
    {
      "id": 35295336,
      "userId": 1,
      "wikiId": 8145
    },
    {
      "id": 18031963,
      "userId": 1,
      "wikiId": 1370
    },
    {
      "id": 92588072,
      "userId": 1,
      "wikiId": 2447
    },
    {
      "id": 28787399,
      "userId": 1,
      "wikiId": 7160
    },
    {
      "id": 48350255,
      "userId": 1,
      "wikiId": 2126
    }
  ],
  "users": [
    {
      "id": "1",
      "name": "João"
    }
  ]
}